language/汇编语言.org
#+SETUPFILE: ~/.emacs.d/themes/org-html-themes/setup/theme-readtheorg.setup
#+OPTIONS: \n:t
#+OPTIONS: ^:nil
#+OPTIONS: tex:t
#+STARTUP: latexpreview
#+OPTIONS: tex:dvipng
#+HTML_MATHJAX: align: left indent: 5em tagside: left font: Neo-Euler
#+attr_html: :width 300px
#+attr_latex: :width 300px
#+ATTR_ORG: :width 300

#+TITLE: 汇编语言 - ABI

#+begin_src c
//foo.c
#include <stdio.h>
#include <stdarg.h>

int global_init_var = 84;
int global_uninit_var;

struct s1 {
    int a;
    int b;
    int c;
};

struct s2 {
    char *a;
    int b;
};


//赋值与算术运算
int func1(int i, struct s1 *s1, struct s2 *s2)
{
    static int static_var = 85;
    static int static_var2;

    int a = 1;

    s1->c = s2->b;
    return static_var + static_var2 + a + i;
}

//if else
int func2(int i)
{
    if (i < 1) {
        return 3;
    } else {
        printf("1 <= i\n");
    }

    return 1;
}

//switch case
int func3(int i)
{
    int rc = -1;

    switch (i) {
    case 1:
        rc = global_uninit_var;
        break;
    case 2:
        rc = 8;
        break;
    case 15:
        printf("i == 15");
        break;
    default:
        break;
    }
    return rc;
}


//loop
int func4(int bound)
{
    int i, sum = 0;

    for (i = 0; i < bound; ++i) {
        sum += i;
    }

    return sum;
}

//不定参
int func5(int count, ...)
{
    va_list argp;
    int i, sum = 0;

    va_start(argp, count);
    for (i = 0; i < count; ++i) {
        sum += va_arg(argp, int);
    }
    va_end(argp);
    return sum;
}

void func6(void)
{
    int i = 1;
    int j = 1;
    int k = 1;
    int l = 1;
    int m = 1;
    int n = 1;

    return;
}

int main(int argc, char *argv[])
{
    struct s1 s1 = {
        .a = 1,
        .b = 2,
        .c = 3,
    };

    struct s2 s2 = {
        .a = "hello",
        .b = 15,
    };

    func1(argc, &s1, &s2);
    func2(argc);
    func3(argc);
    func4(argc);
    printf("%d\n", func5(5, 1, 2, 3, 4, 5));
    func6();
    return 0;
}
#+end_src
