language/汇编语言.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-02 Mon 11:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>汇编语言 - ABI</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="xuali2" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">汇编语言 - ABI</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org54d362d">1. PowerPC32</a>
<ul>
<li><a href="#orgf849512">1.1. 指令</a></li>
<li><a href="#org17d8a80">1.2. ABI</a></li>
<li><a href="#org850652d">1.3. 例程</a>
<ul>
<li><a href="#org5bb0448">1.3.1. gcc -g foo.c</a></li>
<li><a href="#orge5f355c">1.3.2. gcc -O2 foo.c</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org25fb78b">2. Mips64</a></li>
<li><a href="#orgdf00953">3. X86</a>
<ul>
<li><a href="#orgc5860ab">3.1. 指令</a></li>
<li><a href="#org18c63d1">3.2. ABI</a></li>
<li><a href="#orgc079268">3.3. 例程</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #75715E;">//</span><span style="color: #E6DB74;">foo.c</span>
<span style="color: #F92672;">#include</span> <span style="color: #AE81FF;">&lt;</span><span style="color: #E6DB74;">stdio.h</span><span style="color: #AE81FF;">&gt;</span>
<span style="color: #F92672;">#include</span> <span style="color: #AE81FF;">&lt;</span><span style="color: #E6DB74;">stdarg.h</span><span style="color: #AE81FF;">&gt;</span>

<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">global_init_var</span> = 84;
<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">global_uninit_var</span>;

<span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">s1</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">a</span>;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">b</span>;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">c</span>;
<span style="color: #AE81FF;">}</span>;

<span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">s2</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">a</span>;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">b</span>;
<span style="color: #AE81FF;">}</span>;


<span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#36171;&#20540;&#19982;&#31639;&#26415;&#36816;&#31639;</span>
<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">func1</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span>, <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">s1</span> *<span style="color: #FD971F;">s1</span>, <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">s2</span> *<span style="color: #FD971F;">s2</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">static_var</span> = 85;
    <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">static_var2</span>;

    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">a</span> = 1;

    s1-&gt;c = s2-&gt;b;
    <span style="color: #F92672;">return</span> static_var + static_var2 + a + i;
<span style="color: #AE81FF;">}</span>

<span style="color: #75715E;">//</span><span style="color: #E6DB74;">if else</span>
<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">func2</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #A6E22E; font-weight: bold;">if</span> <span style="color: #66D9EF;">(</span>i &lt; 1<span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
        <span style="color: #F92672;">return</span> 3;
    <span style="color: #66D9EF;">}</span> <span style="color: #F92672;">else</span> <span style="color: #66D9EF;">{</span>
        <span style="color: #A6E22E; font-weight: bold;">printf</span><span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">"1 &lt;= i\n"</span><span style="color: #A6E22E;">)</span>;
    <span style="color: #66D9EF;">}</span>

    <span style="color: #F92672;">return</span> 1;
<span style="color: #AE81FF;">}</span>

<span style="color: #75715E;">//</span><span style="color: #E6DB74;">switch case</span>
<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">func3</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">rc</span> = -1;

    <span style="color: #A6E22E; font-weight: bold;">switch</span> <span style="color: #66D9EF;">(</span>i<span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
    <span style="color: #F92672;">case</span> 1:
        rc = global_uninit_var;
        <span style="color: #F92672;">break</span>;
    <span style="color: #F92672;">case</span> 2:
        rc = 8;
        <span style="color: #F92672;">break</span>;
    <span style="color: #F92672;">case</span> 15:
        <span style="color: #A6E22E; font-weight: bold;">printf</span><span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">"i == 15"</span><span style="color: #A6E22E;">)</span>;
        <span style="color: #F92672;">break</span>;
    <span style="color: #F92672;">default</span>:
        <span style="color: #F92672;">break</span>;
    <span style="color: #66D9EF;">}</span>
    <span style="color: #F92672;">return</span> rc;
<span style="color: #AE81FF;">}</span>


<span style="color: #75715E;">//</span><span style="color: #E6DB74;">loop</span>
<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">func4</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">bound</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span>, <span style="color: #FD971F;">sum</span> = 0;

    <span style="color: #A6E22E; font-weight: bold;">for</span> <span style="color: #66D9EF;">(</span>i = 0; i &lt; bound; ++i<span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
        sum += i;
    <span style="color: #66D9EF;">}</span>

    <span style="color: #F92672;">return</span> sum;
<span style="color: #AE81FF;">}</span>

<span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#19981;&#23450;&#21442;</span>
<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">func5</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">count</span>, ...<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #66D9EF;">va_list</span> <span style="color: #FD971F;">argp</span>;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span>, <span style="color: #FD971F;">sum</span> = 0;

    <span style="color: #A6E22E; font-weight: bold;">va_start</span><span style="color: #66D9EF;">(</span>argp, count<span style="color: #66D9EF;">)</span>;
    <span style="color: #A6E22E; font-weight: bold;">for</span> <span style="color: #66D9EF;">(</span>i = 0; i &lt; count; ++i<span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
        sum += <span style="color: #A6E22E; font-weight: bold;">va_arg</span><span style="color: #A6E22E;">(</span>argp, <span style="color: #66D9EF;">int</span><span style="color: #A6E22E;">)</span>;
    <span style="color: #66D9EF;">}</span>
    <span style="color: #A6E22E; font-weight: bold;">va_end</span><span style="color: #66D9EF;">(</span>argp<span style="color: #66D9EF;">)</span>;
    <span style="color: #F92672;">return</span> sum;
<span style="color: #AE81FF;">}</span>

<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">func6</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">void</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span> = 1;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">j</span> = 1;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">k</span> = 1;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">l</span> = 1;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">m</span> = 1;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">n</span> = 1;

    <span style="color: #F92672;">return</span>;
<span style="color: #AE81FF;">}</span>

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span><span style="color: #66D9EF;">[]</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">s1</span> <span style="color: #FD971F;">s1</span> = <span style="color: #66D9EF;">{</span>
        .a = 1,
        .b = 2,
        .c = 3,
    <span style="color: #66D9EF;">}</span>;

    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">s2</span> <span style="color: #FD971F;">s2</span> = <span style="color: #66D9EF;">{</span>
        .a = <span style="color: #E6DB74;">"hello"</span>,
        .b = 15,
    <span style="color: #66D9EF;">}</span>;

    <span style="color: #A6E22E; font-weight: bold;">func1</span><span style="color: #66D9EF;">(</span>argc, &amp;s1, &amp;s2<span style="color: #66D9EF;">)</span>;
    <span style="color: #A6E22E; font-weight: bold;">func2</span><span style="color: #66D9EF;">(</span>argc<span style="color: #66D9EF;">)</span>;
    <span style="color: #A6E22E; font-weight: bold;">func3</span><span style="color: #66D9EF;">(</span>argc<span style="color: #66D9EF;">)</span>;
    <span style="color: #A6E22E; font-weight: bold;">func4</span><span style="color: #66D9EF;">(</span>argc<span style="color: #66D9EF;">)</span>;
    <span style="color: #A6E22E; font-weight: bold;">printf</span><span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"%d\n"</span>, <span style="color: #A6E22E; font-weight: bold;">func5</span><span style="color: #A6E22E;">(</span>5, 1, 2, 3, 4, 5<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>;
    <span style="color: #A6E22E; font-weight: bold;">func6</span><span style="color: #66D9EF;">()</span>;
    <span style="color: #F92672;">return</span> 0;
<span style="color: #AE81FF;">}</span>
</pre>
</div>
