language/汇编语言.org
* PowerPC32
以PowerPC85XX为例，其属于PowerQuICC(Quad Intergrate Communication)通信处理器
所有PowerPC都使用了定长32位指令，是RISC体系结构
微处理器架构
| gpr | 通用寄存器，32个                    |
| pc  | 程序计数器/指令寄存器               |
| lr  | 链接寄存器                          |
| cr  | 条件寄存器，cr0～cr7，8个4bit的字段 |
| ctr | 计数寄存器，类似x86里的ecx          |
| xer | 定点导常及进位溢出信息              |
| msr | 状态寄存器                          |

除了(装入和存储)指令，有直接操作内存的指令，模型处理: *从内存检索数据，在寄存器中对它进行操作，然后将它存储回内存*
PowerQuICC由三个模块组成
| 嵌入式PowerPC核EMPCC          | 执行高层代码                                 |
| 系统接口单元SIU&通信处理器CPM | 集成32位RISC内核，处理实际通信的底层通信功能 |

** 指令
指令缩写
| st   | store                     |
| ld   | load                      |
| r    | right                     |
| l    | left or logical           |
| w    | word， *32位*             |
| u    | update                    |
| m    | move                      |
| f    | from or field             |
| t    | to or than                |
| i    | Immediate                 |
| h    | half word                 |
| z    | zero                      |
| b    | branch                    |
| n    | and                       |
| cmp  | compare                   |
| sub  | subtract                  |
| clr  | clear                     |
| stwu | store word and  update r1 |

数据读写指令
| lbz, lhz, lwz r1, r2 | r2读入至r1，高位清0   |
| stb, sth, stw r1, r2 | r1值存至r2            |
| lis r1, 0x1122h      | r1 = 0x1122h << 16    |
| addi r3, r3, 34h     | r3 = r3 + 34h         |
| or r3, r10, r10      | r3 = r10 or r10 = r10 |

特殊寄存器操作
| mflr rd | rd从lr的值读入 |
| mtlf rd | 将lr值存入rd   |

数值计算指令
| add r3, r4, r5   | r3 = r4 + r5           |
| subf r3, r4, r5  | r3 = r5 - r4           |
| mullw r3, r4, r5 | r3 = r4 * r5           |
| divw r3, r4, r5  | r3 = r4 / r5           |
| and r3, r4, r5   | r3 = r4 and r5         |
| or r3, r4, r5    | r3 = r4 or r5          |
| nor r3, r4, r5   | r3 = not(r4 or r5)     |
| xor r3, r4, r5   | r3 = r4 xor r5         |
| crclr            | control register clear |

crclr bx 等同于 crxor bx, bx, bx 作用是将条件寄存器相应的位清零
crclr so 等同于 crxor 3, 3, 3 将cr0的so位(第3位)清零
 crclr 4*cr3+eq 等同于 crxor 14, 14, 14 将cr3的eq位清零

数据比较指令
| cmpi   | 有符号立即数比较 |
| cmp    | 有符号数比较     |
| cmpli  | 无符号立即数比较 |
| cmpl   | 无符号数比较     |
| cmpwi  | 有符号立即数比较 |
| cmpw   | 有符号数比较     |
| cmplwi | 无符号立即数比较 |
| cmplw  | 无符号数比较     |

转移指令
*l:LK转移指令下一条指令存入LR*
*a:AA地址为目标地址*
| b(ba bl bla) + 目标地址 | 无条件跳转            |
| blr                     | 跳至LR处              |
| bclr                    | 转移目标地址由lr指出  |
| bcctrl                  | 转移目标地址由ctr指出 |
| beq addr                | 等于则跳转addr        |
| beq cr2, addr           | cr2为等于则跳转addr   |
| bne addr                | 不等于则跳转addr      |
| blt addr                | 小于则跳转addr        |
| bgt addr                | 大于则跳转addr        |
| ble addr                | 小于等于则跳转addr    |
| bge addr                | 大于等于则跳转addr    |

指令中的点号“.”表示：指令将更新条件寄存器CR0。如add. rD，rA，rB。
指令中的字母“c”表示：指令显示说明结果影响XER寄存器中的进位位[CA]，如addc rD，rA，rB。
指令中的字母“e”表示：在指令中把XER[CA]中的数据作为一个操作数，并在XER[CA]位记录进位位，如adde rD，rA，rB
指令中的字母“o”表示：溢出标志。对于整数，在XER[OA]位记录溢出和在CR0[SO]记录溢出位，如addo rD，rA，rB

** ABI

- r1是栈指针
- 开栈时r1 = r1 - 栈空间，同时将之前的r1存在r1-栈空间处,此后将r31=r1，用r31索引栈变量
- 寄存器传实参，从r3开始，不够会放到栈中
- 返回值存在r3中
- r1和r1'之间即为当前函数对应的栈空间

#+begin_src artist
+------------+
|   old r1'  | <----- r1
+------------+
|            |
+------------+
|  local var |
+------------+
|     ...    |
+------------+
|  prev r31  |
+------------+
|  old r1''  | <----- old r1'
+------------+
| return lr  |
+------------+
|     ...    |
+------------+
#+end_src

** 例程
