language/汇编语言.html
<div id="outline-container-org54d362d" class="outline-2">
<h2 id="org54d362d"><span class="section-number-2">1</span> PowerPC32</h2>
<div class="outline-text-2" id="text-1">
<p>
以PowerPC85XX为例，其属于PowerQuICC(Quad Intergrate Communication)通信处理器<br />
所有PowerPC都使用了定长32位指令，是RISC体系结构<br />
微处理器架构<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">gpr</td>
<td class="org-left">通用寄存器，32个</td>
</tr>

<tr>
<td class="org-left">pc</td>
<td class="org-left">程序计数器/指令寄存器</td>
</tr>

<tr>
<td class="org-left">lr</td>
<td class="org-left">链接寄存器</td>
</tr>

<tr>
<td class="org-left">cr</td>
<td class="org-left">条件寄存器，cr0～cr7，8个4bit的字段</td>
</tr>

<tr>
<td class="org-left">ctr</td>
<td class="org-left">计数寄存器，类似x86里的ecx</td>
</tr>

<tr>
<td class="org-left">xer</td>
<td class="org-left">定点导常及进位溢出信息</td>
</tr>

<tr>
<td class="org-left">msr</td>
<td class="org-left">状态寄存器</td>
</tr>
</tbody>
</table>

<p>
除了(装入和存储)指令，有直接操作内存的指令，模型处理: <b>从内存检索数据，在寄存器中对它进行操作，然后将它存储回内存</b><br />
PowerQuICC由三个模块组成<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">嵌入式PowerPC核EMPCC</td>
<td class="org-left">执行高层代码</td>
</tr>

<tr>
<td class="org-left">系统接口单元SIU&amp;通信处理器CPM</td>
<td class="org-left">集成32位RISC内核，处理实际通信的底层通信功能</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgf849512" class="outline-3">
<h3 id="orgf849512"><span class="section-number-3">1.1</span> 指令</h3>
<div class="outline-text-3" id="text-1-1">
<p>
指令缩写<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">st</td>
<td class="org-left">store</td>
</tr>

<tr>
<td class="org-left">ld</td>
<td class="org-left">load</td>
</tr>

<tr>
<td class="org-left">r</td>
<td class="org-left">right</td>
</tr>

<tr>
<td class="org-left">l</td>
<td class="org-left">left or logical</td>
</tr>

<tr>
<td class="org-left">w</td>
<td class="org-left">word， <b>32位</b></td>
</tr>

<tr>
<td class="org-left">u</td>
<td class="org-left">update</td>
</tr>

<tr>
<td class="org-left">m</td>
<td class="org-left">move</td>
</tr>

<tr>
<td class="org-left">f</td>
<td class="org-left">from or field</td>
</tr>

<tr>
<td class="org-left">t</td>
<td class="org-left">to or than</td>
</tr>

<tr>
<td class="org-left">i</td>
<td class="org-left">Immediate</td>
</tr>

<tr>
<td class="org-left">h</td>
<td class="org-left">half word</td>
</tr>

<tr>
<td class="org-left">z</td>
<td class="org-left">zero</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-left">branch</td>
</tr>

<tr>
<td class="org-left">n</td>
<td class="org-left">and</td>
</tr>

<tr>
<td class="org-left">cmp</td>
<td class="org-left">compare</td>
</tr>

<tr>
<td class="org-left">sub</td>
<td class="org-left">subtract</td>
</tr>

<tr>
<td class="org-left">clr</td>
<td class="org-left">clear</td>
</tr>

<tr>
<td class="org-left">stwu</td>
<td class="org-left">store word and  update r1</td>
</tr>
</tbody>
</table>

<p>
数据读写指令<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">lbz, lhz, lwz r1, r2</td>
<td class="org-left">r2读入至r1，高位清0</td>
</tr>

<tr>
<td class="org-left">stb, sth, stw r1, r2</td>
<td class="org-left">r1值存至r2</td>
</tr>

<tr>
<td class="org-left">lis r1, 0x1122h</td>
<td class="org-left">r1 = 0x1122h &lt;&lt; 16</td>
</tr>

<tr>
<td class="org-left">addi r3, r3, 34h</td>
<td class="org-left">r3 = r3 + 34h</td>
</tr>

<tr>
<td class="org-left">or r3, r10, r10</td>
<td class="org-left">r3 = r10 or r10 = r10</td>
</tr>
</tbody>
</table>

<p>
特殊寄存器操作<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">mflr rd</td>
<td class="org-left">rd从lr的值读入</td>
</tr>

<tr>
<td class="org-left">mtlf rd</td>
<td class="org-left">将lr值存入rd</td>
</tr>
</tbody>
</table>

<p>
数值计算指令<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">add r3, r4, r5</td>
<td class="org-left">r3 = r4 + r5</td>
</tr>

<tr>
<td class="org-left">subf r3, r4, r5</td>
<td class="org-left">r3 = r5 - r4</td>
</tr>

<tr>
<td class="org-left">mullw r3, r4, r5</td>
<td class="org-left">r3 = r4 * r5</td>
</tr>

<tr>
<td class="org-left">divw r3, r4, r5</td>
<td class="org-left">r3 = r4 / r5</td>
</tr>

<tr>
<td class="org-left">and r3, r4, r5</td>
<td class="org-left">r3 = r4 and r5</td>
</tr>

<tr>
<td class="org-left">or r3, r4, r5</td>
<td class="org-left">r3 = r4 or r5</td>
</tr>

<tr>
<td class="org-left">nor r3, r4, r5</td>
<td class="org-left">r3 = not(r4 or r5)</td>
</tr>

<tr>
<td class="org-left">xor r3, r4, r5</td>
<td class="org-left">r3 = r4 xor r5</td>
</tr>

<tr>
<td class="org-left">crclr</td>
<td class="org-left">control register clear</td>
</tr>
</tbody>
</table>

<p>
crclr bx 等同于 crxor bx, bx, bx 作用是将条件寄存器相应的位清零<br />
crclr so 等同于 crxor 3, 3, 3 将cr0的so位(第3位)清零<br />
 crclr 4*cr3+eq 等同于 crxor 14, 14, 14 将cr3的eq位清零<br />
</p>

<p>
数据比较指令<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">cmpi</td>
<td class="org-left">有符号立即数比较</td>
</tr>

<tr>
<td class="org-left">cmp</td>
<td class="org-left">有符号数比较</td>
</tr>

<tr>
<td class="org-left">cmpli</td>
<td class="org-left">无符号立即数比较</td>
</tr>

<tr>
<td class="org-left">cmpl</td>
<td class="org-left">无符号数比较</td>
</tr>

<tr>
<td class="org-left">cmpwi</td>
<td class="org-left">有符号立即数比较</td>
</tr>

<tr>
<td class="org-left">cmpw</td>
<td class="org-left">有符号数比较</td>
</tr>

<tr>
<td class="org-left">cmplwi</td>
<td class="org-left">无符号立即数比较</td>
</tr>

<tr>
<td class="org-left">cmplw</td>
<td class="org-left">无符号数比较</td>
</tr>
</tbody>
</table>

<p>
转移指令<br />
<b>l:LK转移指令下一条指令存入LR</b><br />
<b>a:AA地址为目标地址</b><br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">b(ba bl bla) + 目标地址</td>
<td class="org-left">无条件跳转</td>
</tr>

<tr>
<td class="org-left">blr</td>
<td class="org-left">跳至LR处</td>
</tr>

<tr>
<td class="org-left">bclr</td>
<td class="org-left">转移目标地址由lr指出</td>
</tr>

<tr>
<td class="org-left">bcctrl</td>
<td class="org-left">转移目标地址由ctr指出</td>
</tr>

<tr>
<td class="org-left">beq addr</td>
<td class="org-left">等于则跳转addr</td>
</tr>

<tr>
<td class="org-left">beq cr2, addr</td>
<td class="org-left">cr2为等于则跳转addr</td>
</tr>

<tr>
<td class="org-left">bne addr</td>
<td class="org-left">不等于则跳转addr</td>
</tr>

<tr>
<td class="org-left">blt addr</td>
<td class="org-left">小于则跳转addr</td>
</tr>

<tr>
<td class="org-left">bgt addr</td>
<td class="org-left">大于则跳转addr</td>
</tr>

<tr>
<td class="org-left">ble addr</td>
<td class="org-left">小于等于则跳转addr</td>
</tr>

<tr>
<td class="org-left">bge addr</td>
<td class="org-left">大于等于则跳转addr</td>
</tr>
</tbody>
</table>

<p>
指令中的点号“.”表示：指令将更新条件寄存器CR0。如add. rD，rA，rB。<br />
指令中的字母“c”表示：指令显示说明结果影响XER寄存器中的进位位[CA]，如addc rD，rA，rB。<br />
指令中的字母“e”表示：在指令中把XER[CA]中的数据作为一个操作数，并在XER[CA]位记录进位位，如adde rD，rA，rB<br />
指令中的字母“o”表示：溢出标志。对于整数，在XER[OA]位记录溢出和在CR0[SO]记录溢出位，如addo rD，rA，rB<br />
</p>
</div>
</div>

<div id="outline-container-org17d8a80" class="outline-3">
<h3 id="org17d8a80"><span class="section-number-3">1.2</span> ABI</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>r1是栈指针<br /></li>
<li>开栈时r1 = r1 - 栈空间，同时将之前的r1存在r1-栈空间处,此后将r31=r1，用r31索引栈变量<br /></li>
<li>寄存器传实参，从r3开始，不够会放到栈中<br /></li>
<li>返回值存在r3中<br /></li>
<li>r1和r1'之间即为当前函数对应的栈空间<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-artist">+------------+
|   old r1'  | &lt;----- r1
+------------+
|            |
+------------+
|  local var |
+------------+
|     ...    |
+------------+
|  prev r31  |
+------------+
|  old r1''  | &lt;----- old r1'
+------------+
| return lr  |
+------------+
|     ...    |
+------------+
</pre>
</div>
</div>
</div>
