language/汇编语言.org
*** gcc -g foo.c
#+begin_src asm
//赋值与算术运算
int func1(int i, struct s1 *s1, struct s2 *s2)
{
10000508:	94 21 ff d0 	stwu    r1,-48(r1) ; 将r1存在r1-48，并更新r1 = r1-48
1000050c:	93 e1 00 2c 	stw     r31,44(r1) ; 存r31到r1 + 44
10000510:	7c 3f 0b 78 	mr      r31,r1     ; r31 = r1
10000514:	90 7f 00 18 	stw     r3,24(r31) ; 入参存到栈中 *(r31+24) = r3, *(r31+28) = r4, *(r3+32) = r5
10000518:	90 9f 00 1c 	stw     r4,28(r31)
1000051c:	90 bf 00 20 	stw     r5,32(r31)
    static int static_var = 85;
    static int static_var2;

    int a = 1;
10000520:	39 20 00 01 	li      r9,1       ; r9 = 1
10000524:	91 3f 00 08 	stw     r9,8(r31)  ; a = *(r31 + 8) = r9 = 1

    s1->c = s2->b;
10000528:	81 3f 00 20 	lwz     r9,32(r31)    ; r9 = s2
1000052c:	81 49 00 04 	lwz     r10,4(r9)     ; r10 = s2->b
10000530:	81 3f 00 1c 	lwz     r9,28(r31)    ; r9 = s1
10000534:	91 49 00 08 	stw     r10,8(r9)     ; s1->c = r10
    return static_var + static_var2 + a + i;
10000538:	3d 20 10 01 	lis     r9,4097
1000053c:	81 49 0b 90 	lwz     r10,2960(r9)  ; r10 = static_var = *((4097 << 16) + 2960)
10000540:	3d 20 10 01 	lis     r9,4097
10000544:	81 29 0c 30 	lwz     r9,3120(r9)   ; r9 = static_var2
10000548:	7d 4a 4a 14 	add     r10,r10,r9    ; r10 = static_var + static_var2
1000054c:	81 3f 00 08 	lwz     r9,8(r31)     ; r9 = a
10000550:	7d 4a 4a 14 	add     r10,r10,r9    ; r10 = static_var + static_var2 + a
10000554:	81 3f 00 18 	lwz     r9,24(r31)    ; r9 = i
10000558:	7d 2a 4a 14 	add     r9,r10,r9     ; r9 = static_var + static_var2 + a + i
}
1000055c:	7d 23 4b 78 	mr      r3,r9         ; 返回值
10000560:	39 7f 00 30 	addi    r11,r31,48    ;
10000564:	83 eb ff fc 	lwz     r31,-4(r11)   ; 和前面指令配合恢复r31的值
10000568:	7d 61 5b 78 	mr      r1,r11        ; r1 = r11 = 调用此函数的栈，即出栈
1000056c:	4e 80 00 20 	blr                   ; lr寄存器存的是调用此函数的代码下一行指令

10000570 <func2>:

//if else
int func2(int i)
{
10000570:	94 21 ff e0 	stwu    r1,-32(r1)                  ; 开栈
10000574:	7c 08 02 a6 	mflr    r0                          ; r0 = lr
10000578:	90 01 00 24 	stw     r0,36(r1)
1000057c:	93 e1 00 1c 	stw     r31,28(r1)
10000580:	7c 3f 0b 78 	mr      r31,r1
10000584:	90 7f 00 08 	stw     r3,8(r31)
    if (i < 1) {
10000588:	81 3f 00 08 	lwz     r9,8(r31)                   ; r9 = i
1000058c:	2f 89 00 00 	cmpwi   cr7,r9,0                    ; r9与0比较，结果放在cr7中
10000590:	41 9d 00 0c 	bgt-    cr7,1000059c <func2+0x2c>   ; 大于则跳转
        return 3;
10000594:	39 20 00 03 	li      r9,3
10000598:	48 00 00 14 	b       100005ac <func2+0x3c>       ; r9 = 3,跳转
    } else {
        printf("1 <= i\n");
1000059c:	3d 20 10 00 	lis     r9,4096
100005a0:	38 69 0a 34 	addi    r3,r9,2612
100005a4:	48 01 06 5d 	bl      10010c00 <puts@plt>
    }

    return 1;
100005a8:	39 20 00 01 	li      r9,1
}
100005ac:	7d 23 4b 78 	mr      r3,r9                       ; r3 = r9，确定返回值
100005b0:	39 7f 00 20 	addi    r11,r31,32
100005b4:	80 0b 00 04 	lwz     r0,4(r11)                   ; 相当于 lwz r0, 36(r11)，恢复r0
100005b8:	7c 08 03 a6 	mtlr    r0                          ; lr = r0，恢复lr值
100005bc:	83 eb ff fc 	lwz     r31,-4(r11)                 ; 恢复r31
100005c0:	7d 61 5b 78 	mr      r1,r11                      ; 退栈
100005c4:	4e 80 00 20 	blr

100005c8 <func3>:

//switch case
int func3(int i)
{
100005c8:	94 21 ff d0 	stwu    r1,-48(r1)                       ; 开栈
100005cc:	7c 08 02 a6 	mflr    r0
100005d0:	90 01 00 34 	stw     r0,52(r1)
100005d4:	93 e1 00 2c 	stw     r31,44(r1)
100005d8:	7c 3f 0b 78 	mr      r31,r1
100005dc:	90 7f 00 18 	stw     r3,24(r31)                       ; 存入参i
    int rc = -1;
100005e0:	39 20 ff ff 	li      r9,-1
100005e4:	91 3f 00 08 	stw     r9,8(r31)                        ; 存rc, -1

    switch (i) {
100005e8:	81 3f 00 18 	lwz     r9,24(r31)
100005ec:	2f 89 00 02 	cmpwi   cr7,r9,2
100005f0:	41 9e 00 24 	beq-    cr7,10000614 <func3+0x4c>        ; i == 2则跳转
100005f4:	2f 89 00 0f 	cmpwi   cr7,r9,15
100005f8:	41 9e 00 28 	beq-    cr7,10000620 <func3+0x58>        ; i == 15则跳转
100005fc:	2f 89 00 01 	cmpwi   cr7,r9,1
10000600:	40 9e 00 34 	bne-    cr7,10000634 <func3+0x6c>        ; i == 1则跳转
    case 1:
        rc = global_uninit_var;
10000604:	3d 20 10 01 	lis     r9,4097
10000608:	81 29 0b ac 	lwz     r9,2988(r9)
1000060c:	91 3f 00 08 	stw     r9,8(r31)
        break;
10000610:	48 00 00 28 	b       10000638 <func3+0x70>
    case 2:
        rc = 8;
10000614:	39 20 00 08 	li      r9,8
10000618:	91 3f 00 08 	stw     r9,8(r31)                        ; rc = 8
        break;
1000061c:	48 00 00 1c 	b       10000638 <func3+0x70>
    case 15:
        printf("i == 15");
10000620:	3d 20 10 00 	lis     r9,4096                          ; printf, 其实用puts也行
10000624:	38 69 0a 3c 	addi    r3,r9,2620
10000628:	4c c6 31 82 	crclr   4*cr1+eq
1000062c:	48 01 05 cd 	bl      10010bf8 <printf@plt>
        break;
10000630:	48 00 00 08 	b       10000638 <func3+0x70>
    default:
        break;
10000634:	60 00 00 00 	nop
    }
    return rc;
10000638:	81 3f 00 08 	lwz     r9,8(r31)                        ; 以下统一退出,r3 = *(r31 + 8)
}
1000063c:	7d 23 4b 78 	mr      r3,r9
10000640:	39 7f 00 30 	addi    r11,r31,48
10000644:	80 0b 00 04 	lwz     r0,4(r11)
10000648:	7c 08 03 a6 	mtlr    r0
1000064c:	83 eb ff fc 	lwz     r31,-4(r11)
10000650:	7d 61 5b 78 	mr      r1,r11
10000654:	4e 80 00 20 	blr

10000658 <func4>:


//loop
int func4(int bound)
{
10000658:	94 21 ff d0 	stwu    r1,-48(r1)
1000065c:	93 e1 00 2c 	stw     r31,44(r1)
10000660:	7c 3f 0b 78 	mr      r31,r1
10000664:	90 7f 00 18 	stw     r3,24(r31)               ; *(r31 + 24) = bound
    int i, sum = 0;
10000668:	39 20 00 00 	li      r9,0
1000066c:	91 3f 00 0c 	stw     r9,12(r31)               ; sum = 0

    for (i = 0; i < bound; ++i) {
10000670:	39 20 00 00 	li      r9,0
10000674:	91 3f 00 08 	stw     r9,8(r31)                ; i = 0
10000678:	48 00 00 20 	b       10000698 <func4+0x40>
        sum += i;
1000067c:	81 5f 00 0c 	lwz     r10,12(r31)              ; r10 = sum
10000680:	81 3f 00 08 	lwz     r9,8(r31)                ; r9 = i
10000684:	7d 2a 4a 14 	add     r9,r10,r9                ; r9 = sum + i
10000688:	91 3f 00 0c 	stw     r9,12(r31)               ; sum = r9
//loop
int func4(int bound)
{
    int i, sum = 0;

    for (i = 0; i < bound; ++i) {
1000068c:	81 3f 00 08 	lwz     r9,8(r31)                ; 取i
10000690:	39 29 00 01 	addi    r9,r9,1                  ; r9 = r9 + 1
10000694:	91 3f 00 08 	stw     r9,8(r31)
10000698:	81 5f 00 08 	lwz     r10,8(r31)
1000069c:	81 3f 00 18 	lwz     r9,24(r31)
100006a0:	7f 8a 48 00 	cmpw    cr7,r10,r9               ; i < bound?
100006a4:	41 9c ff d8 	blt+    cr7,1000067c <func4+0x24>
        sum += i;
    }

    return sum;
100006a8:	81 3f 00 0c 	lwz     r9,12(r31)
}
100006ac:	7d 23 4b 78 	mr      r3,r9
100006b0:	39 7f 00 30 	addi    r11,r31,48
100006b4:	83 eb ff fc 	lwz     r31,-4(r11)
100006b8:	7d 61 5b 78 	mr      r1,r11
100006bc:	4e 80 00 20 	blr

100006c0 <func5>:

//不定参
int func5(int count, ...)
{
100006c0:	94 21 ff a0 	stwu    r1,-96(r1)
100006c4:	93 e1 00 5c 	stw     r31,92(r1)
100006c8:	7c 3f 0b 78 	mr      r31,r1
100006cc:	90 9f 00 2c 	stw     r4,44(r31)
100006d0:	90 bf 00 30 	stw     r5,48(r31)
100006d4:	90 df 00 34 	stw     r6,52(r31)
100006d8:	90 ff 00 38 	stw     r7,56(r31)
100006dc:	91 1f 00 3c 	stw     r8,60(r31)
100006e0:	91 3f 00 40 	stw     r9,64(r31)
100006e4:	91 5f 00 44 	stw     r10,68(r31)    ;保存寄存器
100006e8:	90 7f 00 48 	stw     r3,72(r31)
    va_list argp;
    int i, sum = 0;
100006ec:	39 20 00 00 	li      r9,0
100006f0:	91 3f 00 0c 	stw     r9,12(r31)     ; sum = *(r31 + 12) = 0

    va_start(argp, count);
100006f4:	39 20 00 01 	li      r9,1
100006f8:	99 3f 00 10 	stb     r9,16(r31)     ; 
100006fc:	39 20 00 00 	li      r9,0
10000700:	99 3f 00 11 	stb     r9,17(r31)     ; 
10000704:	39 3f 00 68 	addi    r9,r31,104
10000708:	91 3f 00 14 	stw     r9,20(r31)
1000070c:	39 3f 00 28 	addi    r9,r31,40
10000710:	91 3f 00 18 	stw     r9,24(r31)
    for (i = 0; i < count; ++i) {
10000714:	39 20 00 00 	li      r9,0
10000718:	91 3f 00 08 	stw     r9,8(r31)      ; i = 0
1000071c:	48 00 00 68 	b       10000784 <func5+0xc4>
        sum += va_arg(argp, int);
10000720:	89 3f 00 10 	lbz     r9,16(r31)                   ; 
10000724:	55 29 06 3e 	clrlwi  r9,r9,24
10000728:	2b 89 00 08 	cmplwi  cr7,r9,8
1000072c:	40 9c 00 2c 	bge-    cr7,10000758 <func5+0x98>
10000730:	81 1f 00 18 	lwz     r8,24(r31)
10000734:	89 3f 00 10 	lbz     r9,16(r31)
10000738:	55 2a 06 3e 	clrlwi  r10,r9,24
1000073c:	7d 49 53 78 	mr      r9,r10
10000740:	55 29 10 3a 	rlwinm  r9,r9,2,0,29
10000744:	7d 28 4a 14 	add     r9,r8,r9
10000748:	39 4a 00 01 	addi    r10,r10,1
1000074c:	55 4a 06 3e 	clrlwi  r10,r10,24
10000750:	99 5f 00 10 	stb     r10,16(r31)
10000754:	48 00 00 14 	b       10000768 <func5+0xa8>
10000758:	81 5f 00 14 	lwz     r10,20(r31)
1000075c:	7d 49 53 78 	mr      r9,r10
10000760:	39 4a 00 04 	addi    r10,r10,4
10000764:	91 5f 00 14 	stw     r10,20(r31)
10000768:	81 29 00 00 	lwz     r9,0(r9)
1000076c:	81 5f 00 0c 	lwz     r10,12(r31)
10000770:	7d 2a 4a 14 	add     r9,r10,r9
10000774:	91 3f 00 0c 	stw     r9,12(r31)
{
    va_list argp;
    int i, sum = 0;

    va_start(argp, count);
    for (i = 0; i < count; ++i) {
10000778:	81 3f 00 08 	lwz     r9,8(r31)
1000077c:	39 29 00 01 	addi    r9,r9,1
10000780:	91 3f 00 08 	stw     r9,8(r31)
10000784:	81 5f 00 08 	lwz     r10,8(r31)                ; r10 = i
10000788:	81 3f 00 48 	lwz     r9,72(r31)                ; r9 = count
1000078c:	7f 8a 48 00 	cmpw    cr7,r10,r9                ; 比较
10000790:	41 9c ff 90 	blt+    cr7,10000720 <func5+0x60> ; 小于跳转
        sum += va_arg(argp, int);
    }
    va_end(argp);
    return sum;
10000794:	81 3f 00 0c 	lwz     r9,12(r31)
}
10000798:	7d 23 4b 78 	mr      r3,r9
1000079c:	39 7f 00 60 	addi    r11,r31,96
100007a0:	83 eb ff fc 	lwz     r31,-4(r11)
100007a4:	7d 61 5b 78 	mr      r1,r11
100007a8:	4e 80 00 20 	blr

100007ac <func6>:

void func6(void)
{
100007ac:	94 21 ff d0 	stwu    r1,-48(r1)
100007b0:	93 e1 00 2c 	stw     r31,44(r1)
100007b4:	7c 3f 0b 78 	mr      r31,r1
    int i = 1;
100007b8:	39 20 00 01 	li      r9,1
100007bc:	91 3f 00 08 	stw     r9,8(r31)
    int j = 1;
100007c0:	39 20 00 01 	li      r9,1
100007c4:	91 3f 00 0c 	stw     r9,12(r31)
    int k = 1;
100007c8:	39 20 00 01 	li      r9,1
100007cc:	91 3f 00 10 	stw     r9,16(r31)
    int l = 1;
100007d0:	39 20 00 01 	li      r9,1
100007d4:	91 3f 00 14 	stw     r9,20(r31)
    int m = 1;
100007d8:	39 20 00 01 	li      r9,1
100007dc:	91 3f 00 18 	stw     r9,24(r31)
    int n = 1;
100007e0:	39 20 00 01 	li      r9,1
100007e4:	91 3f 00 1c 	stw     r9,28(r31)

    return;
100007e8:	60 00 00 00 	nop
}
100007ec:	39 7f 00 30 	addi    r11,r31,48
100007f0:	83 eb ff fc 	lwz     r31,-4(r11)
100007f4:	7d 61 5b 78 	mr      r1,r11
100007f8:	4e 80 00 20 	blr

100007fc <main>:

int main(int argc, char *argv[])
{
100007fc:	94 21 ff c0 	stwu    r1,-64(r1)
10000800:	7c 08 02 a6 	mflr    r0
10000804:	90 01 00 44 	stw     r0,68(r1)
10000808:	93 e1 00 3c 	stw     r31,60(r1)
1000080c:	7c 3f 0b 78 	mr      r31,r1
10000810:	90 7f 00 28 	stw     r3,40(r31)
10000814:	90 9f 00 2c 	stw     r4,44(r31)
; 10000a40 00000001 00000002 00000003, 从.rodata中取值，其实多此一举
    struct s1 s1 = {
10000818:	3d 20 10 00 	lis     r9,4096
1000081c:	39 29 0a 48 	addi    r9,r9,2632
10000820:	81 09 00 00 	lwz     r8,0(r9)
10000824:	81 49 00 04 	lwz     r10,4(r9)
10000828:	81 29 00 08 	lwz     r9,8(r9)
1000082c:	91 1f 00 08 	stw     r8,8(r31)      ; s1->a = 1
10000830:	91 5f 00 0c 	stw     r10,12(r31)    ; s1->b = 2
10000834:	91 3f 00 10 	stw     r9,16(r31)     ; s1->c = 3
        .a = 1,
        .b = 2,
        .c = 3,
    };

;
    struct s2 s2 = {
10000838:	3d 20 10 00 	lis     r9,4096
1000083c:	39 29 0a 5c 	addi    r9,r9,2652
10000840:	81 49 00 00 	lwz     r10,0(r9)
10000844:	81 29 00 04 	lwz     r9,4(r9)
10000848:	91 5f 00 14 	stw     r10,20(r31)
1000084c:	91 3f 00 18 	stw     r9,24(r31)
        .a = "hello",
        .b = 15,
    };

    func1(argc, &s1, &s2);
10000850:	39 3f 00 14 	addi    r9,r31,20
10000854:	80 7f 00 28 	lwz     r3,40(r31)
10000858:	39 5f 00 08 	addi    r10,r31,8
1000085c:	7d 44 53 78 	mr      r4,r10
10000860:	7d 25 4b 78 	mr      r5,r9
10000864:	4b ff fc a5 	bl      10000508 <func1>
    func2(argc);
10000868:	80 7f 00 28 	lwz     r3,40(r31)
1000086c:	4b ff fd 05 	bl      10000570 <func2>
    func3(argc);
10000870:	80 7f 00 28 	lwz     r3,40(r31)
10000874:	4b ff fd 55 	bl      100005c8 <func3>
    func4(argc);
10000878:	80 7f 00 28 	lwz     r3,40(r31)
1000087c:	4b ff fd dd 	bl      10000658 <func4>
    printf("%d\n", func5(5, 1, 2, 3, 4, 5));
10000880:	38 60 00 05 	li      r3,5
10000884:	38 80 00 01 	li      r4,1
10000888:	38 a0 00 02 	li      r5,2
1000088c:	38 c0 00 03 	li      r6,3
10000890:	38 e0 00 04 	li      r7,4
10000894:	39 00 00 05 	li      r8,5
10000898:	4c c6 31 82 	crclr   4*cr1+eq
1000089c:	4b ff fe 25 	bl      100006c0 <func5>
100008a0:	7c 69 1b 78 	mr      r9,r3
100008a4:	3d 40 10 00 	lis     r10,4096
100008a8:	38 6a 0a 44 	addi    r3,r10,2628
100008ac:	7d 24 4b 78 	mr      r4,r9
100008b0:	4c c6 31 82 	crclr   4*cr1+eq
100008b4:	48 01 03 45 	bl      10010bf8 <printf@plt>
    func6();
100008b8:	4b ff fe f5 	bl      100007ac <func6>
    return 0;
100008bc:	39 20 00 00 	li      r9,0
}
100008c0:	7d 23 4b 78 	mr      r3,r9
100008c4:	39 7f 00 40 	addi    r11,r31,64
100008c8:	80 0b 00 04 	lwz     r0,4(r11)
100008cc:	7c 08 03 a6 	mtlr    r0
100008d0:	83 eb ff fc 	lwz     r31,-4(r11)
100008d4:	7d 61 5b 78 	mr      r1,r11
100008d8:	4e 80 00 20 	blr
100008dc:	00 01 81 cc 	.long 0x181cc
#+end_src
