language/汇编语言.org
** 指令
- 通用数据传送指令
| mov     | 传送字或字节.                                                                                             |
| movsx   | 先符号扩展,再传送.                                                                                        |
| movzx   | 先零扩展,再传送.                                                                                          |
| push    | 把字压入堆栈.                                                                                             |
| pop     | 把字弹出堆栈.                                                                                             |
| pusha   | 把ax,cx,dx,bx,sp,bp,si,di依次压入堆栈.                                                                    |
| popa    | 把di,si,bp,sp,bx,dx,cx,ax依次弹出堆栈.                                                                    |
| pushad  | 把eax,ecx,edx,ebx,esp,ebp,esi,edi依次压入堆栈.                                                            |
| popad   | 把edi,esi,ebp,esp,ebx,edx,ecx,eax依次弹出堆栈.                                                            |
| bswap   | 交换32位寄存器里字节的顺序                                                                                |
| xchg    | 交换字或字节.(至少有一个操作数为寄存器,段寄存器不可作为操作数)                                            |
| cmpxchg | 比较并交换操作数.(第二个操作数必须为累加器al/ax/eax)                                                      |
| xadd    | 先交换再累加.(结果在第一个操作数里)                                                                       |
| xlat    | 字节查表转换.----bx指向一张256字节的表的起点,al为表的索引值(0-255,即0-ffh);返回al为查表结果.([bx+al]->al) |

- 端口指令
| in  | i/o端口输入. ( 语法: in   累加器,    {端口号│dx} )                                                                                    |
| out | i/o端口输出. ( 语法: out {端口号│dx},累加器 )输入输出端口由立即方式指定时,    其范围是 0-255; 由寄存器 dx 指定时,其范围是    0-65535. |

- 目的地址传送指令
| lea | 装入有效地址.例: lea dx,string ;把偏移地址存到dx.                              |
| lds | 传送目标指针,把指针内容装入ds.例: lds si,string   ;把段地址:偏移地址存到ds:si. |
| les | 传送目标指针,把指针内容装入es.例: les di,string   ;把段地址:偏移地址存到es:di. |
| lfs | 传送目标指针,把指针内容装入fs.例: lfs di,string   ;把段地址:偏移地址存到fs:di. |
| lgs | 传送目标指针,把指针内容装入gs.例: lgs di,string   ;把段地址:偏移地址存到gs:di. |
| lss | 传送目标指针,把指针内容装入ss.例: lss di,string   ;把段地址:偏移地址存到ss:di. |

- 标志传送指令
| lahf  | 标志寄存器传送,把标志装入ah.           |
| sahf  | 标志寄存器传送,把ah内容装入标志寄存器. |
| pushf | 标志入栈.                              |
| popf  | 标志出栈.                              |
| pushd | 32位标志入栈.                          |
| popd  | 32位标志出栈.                          |

- 算术运算指令
| adc  | 带进位加法.                                                                           |
| inc  | 加 1.                                                                                 |
| aaa  | 加法的ascii码调整.                                                                    |
| daa  | 加法的十进制调整.                                                                     |
| sub  | 减法.                                                                                 |
| sbb  | 带借位减法.                                                                           |
| dec  | 减 1.                                                                                 |
| neg  | 求反(以    0 减之).                                                                   |
| cmp  | 比较.(两操作数作减法,仅修改标志位,不回送结果).                                        |
| aas  | 减法的ascii码调整.                                                                    |
| das  | 减法的十进制调整.                                                                     |
| mul  | 无符号乘法.结果回送ah和al(字节运算),或dx和ax(字运算),                                 |
| imul | 整数乘法.结果回送ah和al(字节运算),或dx和ax(字运算),                                   |
| aam  | 乘法的ascii码调整.                                                                    |
| div  | 无符号除法.结果回送:商回送al,余数回送ah, (字节运算);或 商回送ax,余数回送dx, (字运算). |
| idiv | 整数除法.结果回送:商回送al,余数回送ah, (字节运算);或 商回送ax,余数回送dx, (字运算).   |
| aad  | 除法的ascii码调整.                                                                    |
| cbw  | 字节转换为字. (把al中字节的符号扩展到ah中去)                                          |
| cwd  | 字转换为双字. (把ax中的字的符号扩展到dx中去)                                          |
| cwde | 字转换为双字. (把ax中的字符号扩展到eax中去)                                           |
| cdq  | 双字扩展. (把eax中的字的符号扩展到edx中去)                                            |

- 逻辑运算指令
| and  | 与运算.                                          |
| or   | 或运算.                                          |
| xor  | 异或运算.                                        |
| not  | 取反.                                            |
| test | 测试.(两操作数作与运算,仅修改标志位,不回送结果). |
| shl  | 逻辑左移.                                        |
| sal  | 算术左移.(=shl)                                  |
| shr  | 逻辑右移.                                        |
| sar  | 算术右移.(=shr)                                  |
| rol  | 循环左移.                                        |
| ror  | 循环右移.                                        |
| rcl  | 通过进位的循环左移.                              |
| rcr  | 通过进位的循环右移.                              |

- 串指令
  ds:si 源串段寄存器 :源串变址.
  es:di 目标串段寄存器:目标串变址.
  cx 重复次数计数器.
  al/ax 扫描值.
  d标志   0表示重复操作中si和di应自动增量; 1表示应自动减量.
  z标志   用来控制扫描或比较操作的结束.
| movs        | 串传送.( movsb 传送字符. movsw 传送字. movsd 传送双字. )                                             |
| cmps        | 串比较.( cmpsb 比较字符. cmpsw 比较字. )                                                             |
| scas        | 串扫描.把al或ax的内容与目标串作比较,比较结果反映在标志位.                                            |
| lods        | 装入串.把源串中的元素(字或字节)逐一装入al或ax中.( lodsb 传送字符. lodsw 传送字.    lodsd 传送双字. ) |
| stos        | 保存串.是lods的逆过程.                                                                               |
| rep         | 当cx/ecx<>0时重复.                                                                                   |
| repe/repz   | 当zf=1或比较结果相等,且cx/ecx<>0时重复.                                                              |
| repne/repnz | 当zf=0或比较结果不相等,且cx/ecx<>0时重复.                                                            |
| repc        | 当cf=1且cx/ecx<>0时重复.                                                                             |
| repnc       | 当cf=0且cx/ecx<>0时重复.                                                                             |

- 程序转移指令
| jmp      | 无条件转移指令        |
| call     | 过程调用              |
| ret/retf | 过程返回.             |
| ja/jnbe  | 不小于或不等于时转移. |
| jae/jnb  | 大于或等于转移.       |
| jb/jnae  | 小于转移.             |
| jbe/jna  | 小于或等于转移.       |
| jg/jnle  | 大于转移.             |
| jge/jnl  | 大于或等于转移.       |
| jl/jnge  | 小于转移.             |
| jle/jng  | 小于或等于转移.       |
| je/jz    | 等于转移.             |
| jne/jnz  | 不等于时转移.         |
| jc       | 有进位时转移.         |
| jnc      | 无进位时转移.         |
| jno      | 不溢出时转移.         |
| jnp/jpo  | 奇偶性为奇数时转移.   |
| jns      | 符号位为 "0" 时转移.  |
| jo       | 溢出转移.             |
| jp/jpe   | 奇偶性为偶数时转移.   |
| js       | 符号位为 "1" 时转移.  |

- 其他
| lcall                     | 长调转                                                     |
| cmove                     |                                                            |
| lea 0x0(%esi,%eiz,1),%esi | base(offset, index, i)，就是 base+offset+index*i, eiz恒为0 |

