language/汇编语言.html
<div id="outline-container-orge5f355c" class="outline-4">
<h4 id="orge5f355c"><span class="section-number-4">1.3.2</span> gcc -O2 foo.c</h4>
</div>
</div>
</div>

<div id="outline-container-org25fb78b" class="outline-2">
<h2 id="org25fb78b"><span class="section-number-2">2</span> Mips64</h2>
<div class="outline-text-2" id="text-2">
<p>
$0 常量0<br />
#31 $RA 返回地址<br />
</p>
</div>
</div>
<div id="outline-container-orgdf00953" class="outline-2">
<h2 id="orgdf00953"><span class="section-number-2">3</span> X86</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgc5860ab" class="outline-3">
<h3 id="orgc5860ab"><span class="section-number-3">3.1</span> 指令</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>通用数据传送指令<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">mov</td>
<td class="org-left">传送字或字节.</td>
</tr>

<tr>
<td class="org-left">movsx</td>
<td class="org-left">先符号扩展,再传送.</td>
</tr>

<tr>
<td class="org-left">movzx</td>
<td class="org-left">先零扩展,再传送.</td>
</tr>

<tr>
<td class="org-left">push</td>
<td class="org-left">把字压入堆栈.</td>
</tr>

<tr>
<td class="org-left">pop</td>
<td class="org-left">把字弹出堆栈.</td>
</tr>

<tr>
<td class="org-left">pusha</td>
<td class="org-left">把ax,cx,dx,bx,sp,bp,si,di依次压入堆栈.</td>
</tr>

<tr>
<td class="org-left">popa</td>
<td class="org-left">把di,si,bp,sp,bx,dx,cx,ax依次弹出堆栈.</td>
</tr>

<tr>
<td class="org-left">pushad</td>
<td class="org-left">把eax,ecx,edx,ebx,esp,ebp,esi,edi依次压入堆栈.</td>
</tr>

<tr>
<td class="org-left">popad</td>
<td class="org-left">把edi,esi,ebp,esp,ebx,edx,ecx,eax依次弹出堆栈.</td>
</tr>

<tr>
<td class="org-left">bswap</td>
<td class="org-left">交换32位寄存器里字节的顺序</td>
</tr>

<tr>
<td class="org-left">xchg</td>
<td class="org-left">交换字或字节.(至少有一个操作数为寄存器,段寄存器不可作为操作数)</td>
</tr>

<tr>
<td class="org-left">cmpxchg</td>
<td class="org-left">比较并交换操作数.(第二个操作数必须为累加器al/ax/eax)</td>
</tr>

<tr>
<td class="org-left">xadd</td>
<td class="org-left">先交换再累加.(结果在第一个操作数里)</td>
</tr>

<tr>
<td class="org-left">xlat</td>
<td class="org-left">字节查表转换.-&#x2014;bx指向一张256字节的表的起点,al为表的索引值(0-255,即0-ffh);返回al为查表结果.([bx+al]-&gt;al)</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>端口指令<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">in</td>
<td class="org-left">i/o端口输入. ( 语法: in   累加器,    {端口号│dx} )</td>
</tr>

<tr>
<td class="org-left">out</td>
<td class="org-left">i/o端口输出. ( 语法: out {端口号│dx},累加器 )输入输出端口由立即方式指定时,    其范围是 0-255; 由寄存器 dx 指定时,其范围是    0-65535.</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>目的地址传送指令<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">lea</td>
<td class="org-left">装入有效地址.例: lea dx,string ;把偏移地址存到dx.</td>
</tr>

<tr>
<td class="org-left">lds</td>
<td class="org-left">传送目标指针,把指针内容装入ds.例: lds si,string   ;把段地址:偏移地址存到ds:si.</td>
</tr>

<tr>
<td class="org-left">les</td>
<td class="org-left">传送目标指针,把指针内容装入es.例: les di,string   ;把段地址:偏移地址存到es:di.</td>
</tr>

<tr>
<td class="org-left">lfs</td>
<td class="org-left">传送目标指针,把指针内容装入fs.例: lfs di,string   ;把段地址:偏移地址存到fs:di.</td>
</tr>

<tr>
<td class="org-left">lgs</td>
<td class="org-left">传送目标指针,把指针内容装入gs.例: lgs di,string   ;把段地址:偏移地址存到gs:di.</td>
</tr>

<tr>
<td class="org-left">lss</td>
<td class="org-left">传送目标指针,把指针内容装入ss.例: lss di,string   ;把段地址:偏移地址存到ss:di.</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>标志传送指令<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">lahf</td>
<td class="org-left">标志寄存器传送,把标志装入ah.</td>
</tr>

<tr>
<td class="org-left">sahf</td>
<td class="org-left">标志寄存器传送,把ah内容装入标志寄存器.</td>
</tr>

<tr>
<td class="org-left">pushf</td>
<td class="org-left">标志入栈.</td>
</tr>

<tr>
<td class="org-left">popf</td>
<td class="org-left">标志出栈.</td>
</tr>

<tr>
<td class="org-left">pushd</td>
<td class="org-left">32位标志入栈.</td>
</tr>

<tr>
<td class="org-left">popd</td>
<td class="org-left">32位标志出栈.</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>算术运算指令<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">adc</td>
<td class="org-left">带进位加法.</td>
</tr>

<tr>
<td class="org-left">inc</td>
<td class="org-left">加 1.</td>
</tr>

<tr>
<td class="org-left">aaa</td>
<td class="org-left">加法的ascii码调整.</td>
</tr>

<tr>
<td class="org-left">daa</td>
<td class="org-left">加法的十进制调整.</td>
</tr>

<tr>
<td class="org-left">sub</td>
<td class="org-left">减法.</td>
</tr>

<tr>
<td class="org-left">sbb</td>
<td class="org-left">带借位减法.</td>
</tr>

<tr>
<td class="org-left">dec</td>
<td class="org-left">减 1.</td>
</tr>

<tr>
<td class="org-left">neg</td>
<td class="org-left">求反(以    0 减之).</td>
</tr>

<tr>
<td class="org-left">cmp</td>
<td class="org-left">比较.(两操作数作减法,仅修改标志位,不回送结果).</td>
</tr>

<tr>
<td class="org-left">aas</td>
<td class="org-left">减法的ascii码调整.</td>
</tr>

<tr>
<td class="org-left">das</td>
<td class="org-left">减法的十进制调整.</td>
</tr>

<tr>
<td class="org-left">mul</td>
<td class="org-left">无符号乘法.结果回送ah和al(字节运算),或dx和ax(字运算),</td>
</tr>

<tr>
<td class="org-left">imul</td>
<td class="org-left">整数乘法.结果回送ah和al(字节运算),或dx和ax(字运算),</td>
</tr>

<tr>
<td class="org-left">aam</td>
<td class="org-left">乘法的ascii码调整.</td>
</tr>

<tr>
<td class="org-left">div</td>
<td class="org-left">无符号除法.结果回送:商回送al,余数回送ah, (字节运算);或 商回送ax,余数回送dx, (字运算).</td>
</tr>

<tr>
<td class="org-left">idiv</td>
<td class="org-left">整数除法.结果回送:商回送al,余数回送ah, (字节运算);或 商回送ax,余数回送dx, (字运算).</td>
</tr>

<tr>
<td class="org-left">aad</td>
<td class="org-left">除法的ascii码调整.</td>
</tr>

<tr>
<td class="org-left">cbw</td>
<td class="org-left">字节转换为字. (把al中字节的符号扩展到ah中去)</td>
</tr>

<tr>
<td class="org-left">cwd</td>
<td class="org-left">字转换为双字. (把ax中的字的符号扩展到dx中去)</td>
</tr>

<tr>
<td class="org-left">cwde</td>
<td class="org-left">字转换为双字. (把ax中的字符号扩展到eax中去)</td>
</tr>

<tr>
<td class="org-left">cdq</td>
<td class="org-left">双字扩展. (把eax中的字的符号扩展到edx中去)</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>逻辑运算指令<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">and</td>
<td class="org-left">与运算.</td>
</tr>

<tr>
<td class="org-left">or</td>
<td class="org-left">或运算.</td>
</tr>

<tr>
<td class="org-left">xor</td>
<td class="org-left">异或运算.</td>
</tr>

<tr>
<td class="org-left">not</td>
<td class="org-left">取反.</td>
</tr>

<tr>
<td class="org-left">test</td>
<td class="org-left">测试.(两操作数作与运算,仅修改标志位,不回送结果).</td>
</tr>

<tr>
<td class="org-left">shl</td>
<td class="org-left">逻辑左移.</td>
</tr>

<tr>
<td class="org-left">sal</td>
<td class="org-left">算术左移.(=shl)</td>
</tr>

<tr>
<td class="org-left">shr</td>
<td class="org-left">逻辑右移.</td>
</tr>

<tr>
<td class="org-left">sar</td>
<td class="org-left">算术右移.(=shr)</td>
</tr>

<tr>
<td class="org-left">rol</td>
<td class="org-left">循环左移.</td>
</tr>

<tr>
<td class="org-left">ror</td>
<td class="org-left">循环右移.</td>
</tr>

<tr>
<td class="org-left">rcl</td>
<td class="org-left">通过进位的循环左移.</td>
</tr>

<tr>
<td class="org-left">rcr</td>
<td class="org-left">通过进位的循环右移.</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>串指令<br />
ds:si 源串段寄存器 :源串变址.<br />
es:di 目标串段寄存器:目标串变址.<br />
cx 重复次数计数器.<br />
al/ax 扫描值.<br />
d标志   0表示重复操作中si和di应自动增量; 1表示应自动减量.<br />
z标志   用来控制扫描或比较操作的结束.<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">movs</td>
<td class="org-left">串传送.( movsb 传送字符. movsw 传送字. movsd 传送双字. )</td>
</tr>

<tr>
<td class="org-left">cmps</td>
<td class="org-left">串比较.( cmpsb 比较字符. cmpsw 比较字. )</td>
</tr>

<tr>
<td class="org-left">scas</td>
<td class="org-left">串扫描.把al或ax的内容与目标串作比较,比较结果反映在标志位.</td>
</tr>

<tr>
<td class="org-left">lods</td>
<td class="org-left">装入串.把源串中的元素(字或字节)逐一装入al或ax中.( lodsb 传送字符. lodsw 传送字.    lodsd 传送双字. )</td>
</tr>

<tr>
<td class="org-left">stos</td>
<td class="org-left">保存串.是lods的逆过程.</td>
</tr>

<tr>
<td class="org-left">rep</td>
<td class="org-left">当cx/ecx&lt;&gt;0时重复.</td>
</tr>

<tr>
<td class="org-left">repe/repz</td>
<td class="org-left">当zf=1或比较结果相等,且cx/ecx&lt;&gt;0时重复.</td>
</tr>

<tr>
<td class="org-left">repne/repnz</td>
<td class="org-left">当zf=0或比较结果不相等,且cx/ecx&lt;&gt;0时重复.</td>
</tr>

<tr>
<td class="org-left">repc</td>
<td class="org-left">当cf=1且cx/ecx&lt;&gt;0时重复.</td>
</tr>

<tr>
<td class="org-left">repnc</td>
<td class="org-left">当cf=0且cx/ecx&lt;&gt;0时重复.</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>程序转移指令<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">jmp</td>
<td class="org-left">无条件转移指令</td>
</tr>

<tr>
<td class="org-left">call</td>
<td class="org-left">过程调用</td>
</tr>

<tr>
<td class="org-left">ret/retf</td>
<td class="org-left">过程返回.</td>
</tr>

<tr>
<td class="org-left">ja/jnbe</td>
<td class="org-left">不小于或不等于时转移.</td>
</tr>

<tr>
<td class="org-left">jae/jnb</td>
<td class="org-left">大于或等于转移.</td>
</tr>

<tr>
<td class="org-left">jb/jnae</td>
<td class="org-left">小于转移.</td>
</tr>

<tr>
<td class="org-left">jbe/jna</td>
<td class="org-left">小于或等于转移.</td>
</tr>

<tr>
<td class="org-left">jg/jnle</td>
<td class="org-left">大于转移.</td>
</tr>

<tr>
<td class="org-left">jge/jnl</td>
<td class="org-left">大于或等于转移.</td>
</tr>

<tr>
<td class="org-left">jl/jnge</td>
<td class="org-left">小于转移.</td>
</tr>

<tr>
<td class="org-left">jle/jng</td>
<td class="org-left">小于或等于转移.</td>
</tr>

<tr>
<td class="org-left">je/jz</td>
<td class="org-left">等于转移.</td>
</tr>

<tr>
<td class="org-left">jne/jnz</td>
<td class="org-left">不等于时转移.</td>
</tr>

<tr>
<td class="org-left">jc</td>
<td class="org-left">有进位时转移.</td>
</tr>

<tr>
<td class="org-left">jnc</td>
<td class="org-left">无进位时转移.</td>
</tr>

<tr>
<td class="org-left">jno</td>
<td class="org-left">不溢出时转移.</td>
</tr>

<tr>
<td class="org-left">jnp/jpo</td>
<td class="org-left">奇偶性为奇数时转移.</td>
</tr>

<tr>
<td class="org-left">jns</td>
<td class="org-left">符号位为 "0" 时转移.</td>
</tr>

<tr>
<td class="org-left">jo</td>
<td class="org-left">溢出转移.</td>
</tr>

<tr>
<td class="org-left">jp/jpe</td>
<td class="org-left">奇偶性为偶数时转移.</td>
</tr>

<tr>
<td class="org-left">js</td>
<td class="org-left">符号位为 "1" 时转移.</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>其他<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">lcall</td>
<td class="org-left">长调转</td>
</tr>

<tr>
<td class="org-left">cmove</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">lea 0x0(%esi,%eiz,1),%esi</td>
<td class="org-left">base(offset, index, i)，就是 base+offset+index*i, eiz恒为0</td>
</tr>
</tbody>
</table>
</div>
</div>
