language/汇编语言.org
** ABI
- esp是栈指针
- esp和ebp之间即为当前函数对应的栈空间
- 函数返回值存在eax中
- 函数实参入栈从右至左push，调用方负责清除入参
- 不定参时，通ebp + x向栈内索引变量
- 以下栈帧为未优化的标准模型，优化时会根据实际情况对此裁剪

#+begin_src artist
+------------+
|   local    |
|  variable  | <----- esp
|            |
+------------+
|            |
|            |
|   local    |
|  variable  |
|            |
|            |
|            |
+------------+
|   local    |
|  variable  |
|            |
+------------+
|            |
|  old  ebp  | <----- ebp
|            |
+------------+
|            |
|  prev  ip  |
|            |
+------------+
#+end_src

