language/汇编语言.html

<div id="outline-container-org18c63d1" class="outline-3">
<h3 id="org18c63d1"><span class="section-number-3">3.2</span> ABI</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>esp是栈指针<br /></li>
<li>esp和ebp之间即为当前函数对应的栈空间<br /></li>
<li>函数返回值存在eax中<br /></li>
<li>函数实参入栈从右至左push，调用方负责清除入参<br /></li>
<li>不定参时，通ebp + x向栈内索引变量<br /></li>
<li>以下栈帧为未优化的标准模型，优化时会根据实际情况对此裁剪<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-artist">+------------+
|   local    |
|  variable  | &lt;----- esp
|            |
+------------+
|            |
|            |
|   local    |
|  variable  |
|            |
|            |
|            |
+------------+
|   local    |
|  variable  |
|            |
+------------+
|            |
|  old  ebp  | &lt;----- ebp
|            |
+------------+
|            |
|  prev  ip  |
|            |
+------------+
</pre>
</div>
</div>
</div>
