language/汇编语言.org
** 例程

*gcc -m32 -g foo.c*
#+begin_src asm
//赋值与算术运算
int func1(int i, struct s1 *s1, struct s2 *s2)
{
 80484dd:	55                   	push   %ebp
 80484de:	89 e5                	mov    %esp,%ebp
 80484e0:	83 ec 10             	sub    $0x10,%esp        ;开栈
    static int static_var = 85;
    static int static_var2;

    int a = 1;
 80484e3:	c7 45 fc 01 00 00 00 	movl   $0x1,-0x4(%ebp)   ; &a = ebp - 4, a = 1

    s1->c = s2->b;
 80484ea:	8b 45 10             	mov    0x10(%ebp),%eax   ; eax = s2
 80484ed:	8b 50 04             	mov    0x4(%eax),%edx    ; edx = s2->b
 80484f0:	8b 45 0c             	mov    0xc(%ebp),%eax    ; eax = s1
 80484f3:	89 50 08             	mov    %edx,0x8(%eax)    ; s1->c = edx
    return static_var + static_var2 + a + i;
 80484f6:	8b 15 20 a0 04 08    	mov    0x804a020,%edx    ; edx = static_var
 80484fc:	a1 28 a0 04 08       	mov    0x804a028,%eax    ; eax = static_var2
 8048501:	01 c2                	add    %eax,%edx         ; edx = edx + eax
 8048503:	8b 45 fc             	mov    -0x4(%ebp),%eax   ; eax = 1
 8048506:	01 c2                	add    %eax,%edx         ; edx = edx + eax = static_var + static_var2 + 1
 8048508:	8b 45 08             	mov    0x8(%ebp),%eax    ; eax = i
 804850b:	01 d0                	add    %edx,%eax         ; eax = edx + eax = static_var + static_var2 + i + 1
}
 804850d:	c9                   	leave                    ; esp = ebp, pop ebp
 804850e:	c3                   	ret                      ; pop cs:ip

0804850f <func2>:

//if else
int func2(int i)
{
 804850f:	55                   	push   %ebp
 8048510:	89 e5                	mov    %esp,%ebp
 8048512:	83 ec 08             	sub    $0x8,%esp               ; 开栈
    if (i < 1) {
 8048515:	83 7d 08 00          	cmpl   $0x0,0x8(%ebp)          ; 判断i和0x0
 8048519:	7f 07                	jg     8048522 <func2+0x13>    ; 如果大于0x0则跳转至0x8048522，因为i < 1即为i <= 0
        return 3;
 804851b:	b8 03 00 00 00       	mov    $0x3,%eax               ; 返回值置为3
 8048520:	eb 15                	jmp    8048537 <func2+0x28>
    } else {
        printf("1 <= i\n");
 8048522:	83 ec 0c             	sub    $0xc,%esp               ; esp = esp - 0xc
 8048525:	68 5c 87 04 08       	push   $0x804875c              ; 将"1 <=i\n"的地址入栈，esp = esp - 4
 804852a:	e8 51 fe ff ff       	call   8048380 <puts@plt>      ; 因为没有可选参数，则直接使用puts
 804852f:	83 c4 10             	add    $0x10,%esp              ; esp = esp + 0x10，恢复esp，其实esp = esp - 0xc非必须，可以直接push最后esp = esp + 4
    }

    return 1;
 8048532:	b8 01 00 00 00       	mov    $0x1,%eax               ; 返回值值为1
}
 8048537:	c9                   	leave
 8048538:	c3                   	ret

08048539 <func3>:

//switch case
int func3(int i)
{
 8048539:	55                   	push   %ebp
 804853a:	89 e5                	mov    %esp,%ebp
 804853c:	83 ec 18             	sub    $0x18,%esp             ; 开栈
    int rc = -1;
 804853f:	c7 45 f4 ff ff ff ff 	movl   $0xffffffff,-0xc(%ebp) ; rc = -1

    switch (i) {
 8048546:	83 7d 08 02          	cmpl   $0x2,0x8(%ebp)         ; i和0x2比较
 804854a:	74 16                	je     8048562 <func3+0x29>   ; 相等跳转8048562
 804854c:	83 7d 08 0f          	cmpl   $0xf,0x8(%ebp)         ; i和0xf比较
 8048550:	74 19                	je     804856b <func3+0x32>   ; 相等跳转804856b
 8048552:	83 7d 08 01          	cmpl   $0x1,0x8(%ebp)         ; i和0x1比较
 8048556:	75 25                	jne    804857d <func3+0x44>   ; 不等则跳转804857d
    case 1:
        rc = global_uninit_var;
 8048558:	a1 2c a0 04 08       	mov    0x804a02c,%eax         ; 相等即到这里, eax = global_uninit_var = *0x804a02c, *注意这里不是$0x804a02c，所以不是立即数，而是[0x804a02c]*
 804855d:	89 45 f4             	mov    %eax,-0xc(%ebp)        ; rc = *(ebp - 0xc) = eax
        break;
 8048560:	eb 1c                	jmp    804857e <func3+0x45>   ; 跳转至末尾
    case 2:
        rc = 8;
 8048562:	c7 45 f4 08 00 00 00 	movl   $0x8,-0xc(%ebp)        ; rc = 8;
        break;
 8048569:	eb 13                	jmp    804857e <func3+0x45>   ; 跳转至末尾
    case 15:
        printf("i == 15");
 804856b:	83 ec 0c             	sub    $0xc,%esp
 804856e:	68 63 87 04 08       	push   $0x8048763
 8048573:	e8 f8 fd ff ff       	call   8048370 <printf@plt>
 8048578:	83 c4 10             	add    $0x10,%esp             ; printf
        break;
 804857b:	eb 01                	jmp    804857e <func3+0x45>
    default:
        break;
 804857d:	90                   	nop                           ; nothing
    }
    return rc;
 804857e:	8b 45 f4             	mov    -0xc(%ebp),%eax        ; eax = rc
}
 8048581:	c9                   	leave
 8048582:	c3                   	ret

08048583 <func4>:


//loop
int func4(int bound)
{
 8048583:	55                   	push   %ebp
 8048584:	89 e5                	mov    %esp,%ebp
 8048586:	83 ec 10             	sub    $0x10,%esp             ; 开栈
    int i, sum = 0;
 8048589:	c7 45 f8 00 00 00 00 	movl   $0x0,-0x8(%ebp)        ; sum = *(ebp - 8) = 0

    for (i = 0; i < bound; ++i) {
 8048590:	c7 45 fc 00 00 00 00 	movl   $0x0,-0x4(%ebp)        ; i = *(ebp - 4) = 0
 8048597:	eb 0a                	jmp    80485a3 <func4+0x20>   ; 跳转
        sum += i;
 8048599:	8b 45 fc             	mov    -0x4(%ebp),%eax        ; eax = i
 804859c:	01 45 f8             	add    %eax,-0x8(%ebp)        ; sum += eax
    for (i = 0; i < bound; ++i) {
 804859f:	83 45 fc 01          	addl   $0x1,-0x4(%ebp)        ; i += 1
 80485a3:	8b 45 fc             	mov    -0x4(%ebp),%eax        ; eax = *(ebp - 4)
 80485a6:	3b 45 08             	cmp    0x8(%ebp),%eax         ; 比较 eax和sum
 80485a9:	7c ee                	jl     8048599 <func4+0x16>   ; 少于则跳转至8048599
    }

    return sum;
 80485ab:	8b 45 f8             	mov    -0x8(%ebp),%eax        ; eax = sum
}
 80485ae:	c9                   	leave
 80485af:	c3                   	ret

080485b0 <func5>:

//不定参
int func5(int count, ...)
{
 80485b0:	55                   	push   %ebp
 80485b1:	89 e5                	mov    %esp,%ebp
 80485b3:	83 ec 10             	sub    $0x10,%esp             ; 开栈
    va_list argp;
    int i, sum = 0;
 80485b6:	c7 45 f8 00 00 00 00 	movl   $0x0,-0x8(%ebp)        ; sum = *(ebp - 8) = 0

    va_start(argp, count);
 80485bd:	8d 45 0c             	lea    0xc(%ebp),%eax         ; eax = ebp + 0xc = &count
 80485c0:	89 45 f4             	mov    %eax,-0xc(%ebp)        ; argp = ebp - 0xc = eax
    for (i = 0; i < count; ++i) {
 80485c3:	c7 45 fc 00 00 00 00 	movl   $0x0,-0x4(%ebp)        ; i = *(ebp - 0x4) = 0
 80485ca:	eb 12                	jmp    80485de <func5+0x2e>   ; 跳至0x80485de
        sum += va_arg(argp, int);
 80485cc:	8b 45 f4             	mov    -0xc(%ebp),%eax        ; eax = argp
 80485cf:	8d 50 04             	lea    0x4(%eax),%edx         ; edx = eax + 4
 80485d2:	89 55 f4             	mov    %edx,-0xc(%ebp)        ; argp = edx
 80485d5:	8b 00                	mov    (%eax),%eax            ; eax = *(eax)
 80485d7:	01 45 f8             	add    %eax,-0x8(%ebp)        ; sum = *(ebp - 0x8) + eax
    for (i = 0; i < count; ++i) {
 80485da:	83 45 fc 01          	addl   $0x1,-0x4(%ebp)        ; i = i + 1
 80485de:	8b 45 fc             	mov    -0x4(%ebp),%eax        ; eax = *(ebp - 0x4)
 80485e1:	3b 45 08             	cmp    0x8(%ebp),%eax         ; 比较eax和count = *(ebp + 0x8)
 80485e4:	7c e6                	jl     80485cc <func5+0x1c>   ; 跳至80485cc
    }
    va_end(argp);
    return sum;
 80485e6:	8b 45 f8             	mov    -0x8(%ebp),%eax        ; eax = sum = *(ebp - 0x8)
}
 80485e9:	c9                   	leave                         ; 出栈
 80485ea:	c3                   	ret

080485eb <func6>:

void func6(void)
{
 80485eb:	55                   	push   %ebp
 80485ec:	89 e5                	mov    %esp,%ebp
 80485ee:	83 ec 20             	sub    $0x20,%esp
    int i = 1;
 80485f1:	c7 45 fc 01 00 00 00 	movl   $0x1,-0x4(%ebp)
    int j = 1;
 80485f8:	c7 45 f8 01 00 00 00 	movl   $0x1,-0x8(%ebp)
    int k = 1;
 80485ff:	c7 45 f4 01 00 00 00 	movl   $0x1,-0xc(%ebp)
    int l = 1;
 8048606:	c7 45 f0 01 00 00 00 	movl   $0x1,-0x10(%ebp)
    int m = 1;
 804860d:	c7 45 ec 01 00 00 00 	movl   $0x1,-0x14(%ebp)
    int n = 1;
 8048614:	c7 45 e8 01 00 00 00 	movl   $0x1,-0x18(%ebp)

    return;
 804861b:	90                   	nop
}
 804861c:	c9                   	leave
 804861d:	c3                   	ret

0804861e <main>:

int main(int argc, char *argv[])
{
 804861e:	8d 4c 24 04          	lea    0x4(%esp),%ecx     ; ecx = &(esp + 0x4), 即&argc
 8048622:	83 e4 f0             	and    $0xfffffff0,%esp   ;
 8048625:	ff 71 fc             	pushl  -0x4(%ecx)         ; push *(ecx - 4) = *(prev esp)
 8048628:	55                   	push   %ebp
 8048629:	89 e5                	mov    %esp,%ebp
 804862b:	53                   	push   %ebx
 804862c:	51                   	push   %ecx
 804862d:	83 ec 20             	sub    $0x20,%esp         ; 开栈
 8048630:	89 cb                	mov    %ecx,%ebx          ; ebx = ecx, *ecx是argc, &argv是&argc + sizeof(void *)
    struct s1 s1 = {
 8048632:	c7 45 ec 01 00 00 00 	movl   $0x1,-0x14(%ebp)
 8048639:	c7 45 f0 02 00 00 00 	movl   $0x2,-0x10(%ebp)
 8048640:	c7 45 f4 03 00 00 00 	movl   $0x3,-0xc(%ebp)
        .a = 1,
        .b = 2,
        .c = 3,
    };

    struct s2 s2 = {
 8048647:	c7 45 e4 6b 87 04 08 	movl   $0x804876b,-0x1c(%ebp)
 804864e:	c7 45 e8 0f 00 00 00 	movl   $0xf,-0x18(%ebp)
        .a = "hello",
        .b = 15,
    };

    func1(argc, &s1, &s2);
 8048655:	8d 45 e4             	lea    -0x1c(%ebp),%eax
 8048658:	50                   	push   %eax
 8048659:	8d 45 ec             	lea    -0x14(%ebp),%eax
 804865c:	50                   	push   %eax
 804865d:	ff 33                	pushl  (%ebx)             ; push argc
 804865f:	e8 79 fe ff ff       	call   80484dd <func1>
 8048664:	83 c4 0c             	add    $0xc,%esp
    func2(argc);
 8048667:	83 ec 0c             	sub    $0xc,%esp
 804866a:	ff 33                	pushl  (%ebx)
 804866c:	e8 9e fe ff ff       	call   804850f <func2>
 8048671:	83 c4 10             	add    $0x10,%esp
    func3(argc);
 8048674:	83 ec 0c             	sub    $0xc,%esp
 8048677:	ff 33                	pushl  (%ebx)
 8048679:	e8 bb fe ff ff       	call   8048539 <func3>
 804867e:	83 c4 10             	add    $0x10,%esp
    func4(argc);
 8048681:	83 ec 0c             	sub    $0xc,%esp
 8048684:	ff 33                	pushl  (%ebx)
 8048686:	e8 f8 fe ff ff       	call   8048583 <func4>
 804868b:	83 c4 10             	add    $0x10,%esp
    printf("%d\n", func5(5, 1, 2, 3, 4, 5));
 804868e:	83 ec 08             	sub    $0x8,%esp
 8048691:	6a 05                	push   $0x5
 8048693:	6a 04                	push   $0x4
 8048695:	6a 03                	push   $0x3
 8048697:	6a 02                	push   $0x2
 8048699:	6a 01                	push   $0x1
 804869b:	6a 05                	push   $0x5
 804869d:	e8 0e ff ff ff       	call   80485b0 <func5>
 80486a2:	83 c4 20             	add    $0x20,%esp
 80486a5:	83 ec 08             	sub    $0x8,%esp
 80486a8:	50                   	push   %eax
 80486a9:	68 71 87 04 08       	push   $0x8048771
 80486ae:	e8 bd fc ff ff       	call   8048370 <printf@plt>
 80486b3:	83 c4 10             	add    $0x10,%esp
    func6();
 80486b6:	e8 30 ff ff ff       	call   80485eb <func6>
    return 0;
 80486bb:	b8 00 00 00 00       	mov    $0x0,%eax
}
 80486c0:	8d 65 f8             	lea    -0x8(%ebp),%esp
 80486c3:	59                   	pop    %ecx
 80486c4:	5b                   	pop    %ebx
 80486c5:	5d                   	pop    %ebp
 80486c6:	8d 61 fc             	lea    -0x4(%ecx),%esp
 80486c9:	c3                   	ret
 80486ca:	66 90                	xchg   %ax,%ax
 80486cc:	66 90                	xchg   %ax,%ax
 80486ce:	66 90                	xchg   %ax,%ax
#+end_src

*gcc -m32 -O2 foo.c*
#+begin_src asm

; 编译器对main的优化
; - func1 无任何输出
; - func2 如果i非0，则输出"1<= i\n"，因为为确定值，所以直接内联
Disassembly of section .text:

080483a0 <main>:
 80483a0:	8d 4c 24 04          	lea    0x4(%esp),%ecx      ; ecx = &argc
 80483a4:	83 e4 f0             	and    $0xfffffff0,%esp
 80483a7:	ff 71 fc             	pushl  -0x4(%ecx)          ; push *(ecx - 4) = *(prev esp)
 80483aa:	55                   	push   %ebp
 80483ab:	89 e5                	mov    %esp,%ebp
 80483ad:	53                   	push   %ebx
 80483ae:	8b 19                	mov    (%ecx),%ebx         ; ebx = *ecx = argc
 80483b0:	51                   	push   %ecx
 80483b1:	85 db                	test   %ebx,%ebx           ; ebx非0则不执行puts("1 <= i\n")
 80483b3:	7e 10                	jle    80483c5 <main+0x25>
 80483b5:	83 ec 0c             	sub    $0xc,%esp
 80483b8:	68 ec 86 04 08       	push   $0x80486ec
 80483bd:	e8 be ff ff ff       	call   8048380 <puts@plt>
 80483c2:	83 c4 10             	add    $0x10,%esp
 80483c5:	83 ec 0c             	sub    $0xc,%esp
 80483c8:	53                   	push   %ebx                ; push i = argc
 80483c9:	e8 d2 01 00 00       	call   80485a0 <func3>
 80483ce:	58                   	pop    %eax
 80483cf:	5a                   	pop    %edx
 80483d0:	6a 05                	push   $0x5
 80483d2:	6a 04                	push   $0x4
 80483d4:	6a 03                	push   $0x3
 80483d6:	6a 02                	push   $0x2
 80483d8:	6a 01                	push   $0x1
 80483da:	6a 05                	push   $0x5
 80483dc:	e8 3f 02 00 00       	call   8048620 <func5>     ; call fun5
 80483e1:	83 c4 18             	add    $0x18,%esp
 80483e4:	50                   	push   %eax
 80483e5:	68 fb 86 04 08       	push   $0x80486fb
 80483ea:	e8 81 ff ff ff       	call   8048370 <printf@plt> ; print
 80483ef:	83 c4 10             	add    $0x10,%esp
 80483f2:	8d 65 f8             	lea    -0x8(%ebp),%esp
 80483f5:	31 c0                	xor    %eax,%eax
 80483f7:	59                   	pop    %ecx
 80483f8:	5b                   	pop    %ebx
 80483f9:	5d                   	pop    %ebp
 80483fa:	8d 61 fc             	lea    -0x4(%ecx),%esp
 80483fd:	c3                   	ret

08048540 <func1>:
 8048540:	8b 44 24 0c          	mov    0xc(%esp),%eax        ; eax = s2
 8048544:	8b 50 04             	mov    0x4(%eax),%edx        ; edx = s2->b
 8048547:	8b 44 24 08          	mov    0x8(%esp),%eax        ; eax = s1
 804854b:	89 50 08             	mov    %edx,0x8(%eax)        ; s1->c = edx = s2->b
 804854e:	8b 44 24 04          	mov    0x4(%esp),%eax        ; eax = i
 8048552:	83 c0 56             	add    $0x56,%eax            ; eax = i + 0x56, *首先static_var2并没有人用，所以编译认为是0，其实a永远为1所以static_var + 1= 85 + 1 = 0x56*
 8048555:	c3                   	ret
 8048556:	8d 76 00             	lea    0x0(%esi),%esi
 8048559:	8d bc 27 00 00 00 00 	lea    0x0(%edi,%eiz,1),%edi

08048560 <func2>:
 8048560:	83 ec 0c             	sub    $0xc,%esp             ; esp = esp - 0xc
 8048563:	8b 44 24 10          	mov    0x10(%esp),%eax       ; eax = *(esp + 0x10) = i
 8048567:	85 c0                	test   %eax,%eax             ; 判断是否为0
 8048569:	7e 1d                	jle    8048588 <func2+0x28>  ; 小于跳转
 804856b:	83 ec 0c             	sub    $0xc,%esp
 804856e:	68 ec 86 04 08       	push   $0x80486ec
 8048573:	e8 08 fe ff ff       	call   8048380 <puts@plt>
 8048578:	83 c4 10             	add    $0x10,%esp            ; puts("1 <= i\n")
 804857b:	b8 01 00 00 00       	mov    $0x1,%eax             ; 返回值1
 8048580:	83 c4 0c             	add    $0xc,%esp
 8048583:	c3                   	ret
 8048584:	8d 74 26 00          	lea    0x0(%esi,%eiz,1),%esi
 8048588:	b8 03 00 00 00       	mov    $0x3,%eax             ; 返回值3
 804858d:	83 c4 0c             	add    $0xc,%esp
 8048590:	c3                   	ret
 8048591:	eb 0d                	jmp    80485a0 <func3>
 8048593:	90                   	nop
 8048594:	90                   	nop
 8048595:	90                   	nop
 8048596:	90                   	nop
 8048597:	90                   	nop
 8048598:	90                   	nop
 8048599:	90                   	nop
 804859a:	90                   	nop
 804859b:	90                   	nop
 804859c:	90                   	nop
 804859d:	90                   	nop
 804859e:	90                   	nop
 804859f:	90                   	nop

080485a0 <func3>:
 80485a0:	83 ec 0c             	sub    $0xc,%esp
 80485a3:	b8 08 00 00 00       	mov    $0x8,%eax             ; 返回值8先赋值好
 80485a8:	8b 54 24 10          	mov    0x10(%esp),%edx       ; edx = 入参i
 80485ac:	83 fa 02             	cmp    $0x2,%edx             ; 和2比较
 80485af:	74 14                	je     80485c5 <func3+0x25>  ; 相等时出栈
 80485b1:	83 fa 0f             	cmp    $0xf,%edx             ; 和0xf比较
 80485b4:	74 1a                	je     80485d0 <func3+0x30>  ; 相等时跳转
 80485b6:	83 fa 01             	cmp    $0x1,%edx             ; 和1比较
 80485b9:	b8 ff ff ff ff       	mov    $0xffffffff,%eax
 80485be:	0f 44 05 24 a0 04 08 	cmove  0x804a024,%eax        ; rc = global_uninit_var
 80485c5:	83 c4 0c             	add    $0xc,%esp
 80485c8:	c3                   	ret
 80485c9:	8d b4 26 00 00 00 00 	lea    0x0(%esi,%eiz,1),%esi
 80485d0:	83 ec 0c             	sub    $0xc,%esp             ; i == 15,执行puts，返回-1
 80485d3:	68 f3 86 04 08       	push   $0x80486f3
 80485d8:	e8 93 fd ff ff       	call   8048370 <printf@plt>
 80485dd:	83 c4 10             	add    $0x10,%esp
 80485e0:	b8 ff ff ff ff       	mov    $0xffffffff,%eax
 80485e5:	83 c4 0c             	add    $0xc,%esp
 80485e8:	c3                   	ret
 80485e9:	8d b4 26 00 00 00 00 	lea    0x0(%esi,%eiz,1),%esi

080485f0 <func4>:
; 编译器优化后，并没有局部变量i，eax即为sum，edx用作i的作用，每个loop edx和bound比，同时将edx加到返回值eax中
 80485f0:	8b 4c 24 04          	mov    0x4(%esp),%ecx        ; ecx = bound
 80485f4:	31 c0                	xor    %eax,%eax             ; eax = 0
 80485f6:	85 c9                	test   %ecx,%ecx             ; ecx = 0 ?
 80485f8:	7e 16                	jle    8048610 <func4+0x20>  ; bound = 0即退出
 80485fa:	31 d2                	xor    %edx,%edx             ; edx = 0
 80485fc:	8d 74 26 00          	lea    0x0(%esi,%eiz,1),%esi ; 相当于nop
 8048600:	01 d0                	add    %edx,%eax             ;
 8048602:	83 c2 01             	add    $0x1,%edx             ; edx = edx + 1
 8048605:	39 d1                	cmp    %edx,%ecx             ; edx和ecx比较
 8048607:	75 f7                	jne    8048600 <func4+0x10>  ; 继续回跳+1
 8048609:	c3                   	ret
 804860a:	8d b6 00 00 00 00    	lea    0x0(%esi),%esi
 8048610:	c3                   	ret
 8048611:	eb 0d                	jmp    8048620 <func5>
 8048613:	90                   	nop
 8048614:	90                   	nop
 8048615:	90                   	nop
 8048616:	90                   	nop
 8048617:	90                   	nop
 8048618:	90                   	nop
 8048619:	90                   	nop
 804861a:	90                   	nop
 804861b:	90                   	nop
 804861c:	90                   	nop
 804861d:	90                   	nop
 804861e:	90                   	nop
 804861f:	90                   	nop

08048620 <func5>:
 8048620:	8b 4c 24 04          	mov    0x4(%esp),%ecx        ; ecx = count
 8048624:	31 c0                	xor    %eax,%eax             ; eax = 0
 8048626:	85 c9                	test   %ecx,%ecx
 8048628:	7e 16                	jle    8048640 <func5+0x20>  ; 为0则直接退出
 804862a:	31 d2                	xor    %edx,%edx             ; edx = 0
 804862c:	8d 74 26 00          	lea    0x0(%esi,%eiz,1),%esi ; nop
 8048630:	03 44 94 08          	add    0x8(%esp,%edx,4),%eax ; eax = 0x8 + esp + 4 * edx，即count地址下面的不定参，加到eax中
 8048634:	83 c2 01             	add    $0x1,%edx             ; edx 递增
 8048637:	39 d1                	cmp    %edx,%ecx             ; edx < count则继续,编译器将 i < count优化为i != count
 8048639:	75 f5                	jne    8048630 <func5+0x10>
 804863b:	c3                   	ret
 804863c:	8d 74 26 00          	lea    0x0(%esi,%eiz,1),%esi
 8048640:	c3                   	ret
 8048641:	eb 0d                	jmp    8048650 <func6>
 8048643:	90                   	nop
 8048644:	90                   	nop
 8048645:	90                   	nop
 8048646:	90                   	nop
 8048647:	90                   	nop
 8048648:	90                   	nop
 8048649:	90                   	nop
 804864a:	90                   	nop
 804864b:	90                   	nop
 804864c:	90                   	nop
 804864d:	90                   	nop
 804864e:	90                   	nop
 804864f:	90                   	nop

08048650 <func6>:
 8048650:	c3                   	ret             ; 因为func6无任何输出及副作用，所以直接返回
 8048651:	66 90                	xchg   %ax,%ax
 8048653:	66 90                	xchg   %ax,%ax
 8048655:	66 90                	xchg   %ax,%ax
 8048657:	66 90                	xchg   %ax,%ax
 8048659:	66 90                	xchg   %ax,%ax
 804865b:	66 90                	xchg   %ax,%ax
 804865d:	66 90                	xchg   %ax,%ax
 804865f:	90                   	nop
#+end_src
