language/汇编语言.html

<div id="outline-container-orgc079268" class="outline-3">
<h3 id="orgc079268"><span class="section-number-3">3.3</span> 例程</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<b>gcc -m32 -g foo.c</b><br />
</p>
<div class="org-src-container">
<pre class="src src-asm"><span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#36171;&#20540;&#19982;&#31639;&#26415;&#36816;&#31639;</span>
<span style="color: #A6E22E; font-size: 130%;">int</span> <span style="color: #F92672;">func1</span>(int i, struct s1 *s1, struct s2 *s2)
{
 <span style="color: #F92672;">80484dd</span>:   55                      push   <span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">80484de</span>:   89 e5                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">80484e0</span>:   83 ec 10                sub    $0x10,<span style="color: #FD971F;">%esp</span>        <span style="color: #75715E;">;</span><span style="color: #E6DB74;">&#24320;&#26632;</span>
    <span style="color: #F92672;">static</span> int static_var = 85<span style="color: #75715E;">;</span>
    <span style="color: #F92672;">static</span> int static_var2<span style="color: #75715E;">;</span>

    <span style="color: #F92672;">int</span> a = 1<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">80484e3</span>:   c7 45 fc 01 00 00 00    movl   $0x1,-0x4(<span style="color: #FD971F;">%ebp</span>)   <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&amp;a = ebp - 4, a = 1</span>

    <span style="color: #F92672;">s1-&gt;c</span> = s2-&gt;b<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">80484ea</span>:   8b 45 10                mov    0x10(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>   <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = s2</span>
 <span style="color: #F92672;">80484ed</span>:   8b 50 04                mov    0x4(<span style="color: #FD971F;">%eax</span>),<span style="color: #FD971F;">%edx</span>    <span style="color: #75715E;">; </span><span style="color: #E6DB74;">edx = s2-&gt;b</span>
 <span style="color: #F92672;">80484f0</span>:   8b 45 0c                mov    0xc(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>    <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = s1</span>
 <span style="color: #F92672;">80484f3</span>:   89 50 08                mov    <span style="color: #FD971F;">%edx</span>,0x8(<span style="color: #FD971F;">%eax</span>)    <span style="color: #75715E;">; </span><span style="color: #E6DB74;">s1-&gt;c = edx</span>
    <span style="color: #F92672;">return</span> static_var + static_var2 + a + i<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">80484f6</span>:   8b 15 20 a0 04 08       mov    0x804a020,<span style="color: #FD971F;">%edx</span>    <span style="color: #75715E;">; </span><span style="color: #E6DB74;">edx = static_var</span>
 <span style="color: #F92672;">80484fc</span>:   a1 28 a0 04 08          mov    0x804a028,<span style="color: #FD971F;">%eax</span>    <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = static_var2</span>
 <span style="color: #F92672;">8048501</span>:   01 c2                   add    <span style="color: #FD971F;">%eax</span>,<span style="color: #FD971F;">%edx</span>         <span style="color: #75715E;">; </span><span style="color: #E6DB74;">edx = edx + eax</span>
 <span style="color: #F92672;">8048503</span>:   8b 45 fc                mov    -0x4(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>   <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = 1</span>
 <span style="color: #F92672;">8048506</span>:   01 c2                   add    <span style="color: #FD971F;">%eax</span>,<span style="color: #FD971F;">%edx</span>         <span style="color: #75715E;">; </span><span style="color: #E6DB74;">edx = edx + eax = static_var + static_var2 + 1</span>
 <span style="color: #F92672;">8048508</span>:   8b 45 08                mov    0x8(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>    <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = i</span>
 <span style="color: #F92672;">804850b</span>:   01 d0                   add    <span style="color: #FD971F;">%edx</span>,<span style="color: #FD971F;">%eax</span>         <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = edx + eax = static_var + static_var2 + i + 1</span>
}
 <span style="color: #F92672;">804850d</span>:   c9                      leave                    <span style="color: #75715E;">; </span><span style="color: #E6DB74;">esp = ebp, pop ebp</span>
 <span style="color: #F92672;">804850e</span>:   c3                      ret                      <span style="color: #75715E;">; </span><span style="color: #E6DB74;">pop cs:ip</span>

<span style="color: #A6E22E; font-size: 130%;">0804850f</span> &lt;func2&gt;:

<span style="color: #75715E;">//</span><span style="color: #E6DB74;">if else</span>
<span style="color: #A6E22E; font-size: 130%;">int</span> <span style="color: #F92672;">func2</span>(int i)
{
 <span style="color: #F92672;">804850f</span>:   55                      push   <span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">8048510</span>:   89 e5                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">8048512</span>:   83 ec 08                sub    $0x8,<span style="color: #FD971F;">%esp</span>               <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#24320;&#26632;</span>
    <span style="color: #F92672;">if</span> (i &lt; 1) {
 <span style="color: #F92672;">8048515</span>:   83 7d 08 00             cmpl   $0x0,0x8(<span style="color: #FD971F;">%ebp</span>)          <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#21028;&#26029;i&#21644;0x0</span>
 <span style="color: #F92672;">8048519</span>:   7f 07                   jg     8048522 &lt;func2+0x13&gt;    <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#22914;&#26524;&#22823;&#20110;0x0&#21017;&#36339;&#36716;&#33267;0x8048522&#65292;&#22240;&#20026;i &lt; 1&#21363;&#20026;i &lt;= 0</span>
        <span style="color: #F92672;">return</span> 3<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">804851b</span>:   b8 03 00 00 00          mov    $0x3,<span style="color: #FD971F;">%eax</span>               <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#36820;&#22238;&#20540;&#32622;&#20026;3</span>
 <span style="color: #F92672;">8048520</span>:   eb 15                   jmp    8048537 &lt;func2+0x28&gt;
    } else {
        <span style="color: #F92672;">printf</span>(<span style="color: #E6DB74;">"1 &lt;= i\n"</span>)<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048522</span>:   83 ec 0c                sub    $0xc,<span style="color: #FD971F;">%esp</span>               <span style="color: #75715E;">; </span><span style="color: #E6DB74;">esp = esp - 0xc</span>
 <span style="color: #F92672;">8048525</span>:   68 5c 87 04 08          push   $0x804875c              <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#23558;"1 &lt;=i\n"&#30340;&#22320;&#22336;&#20837;&#26632;&#65292;esp = esp - 4</span>
 <span style="color: #F92672;">804852a</span>:   e8 51 fe ff ff          call   8048380 <a href="mailto:puts%40plt">&lt;puts@plt&gt;</a>      <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#22240;&#20026;&#27809;&#26377;&#21487;&#36873;&#21442;&#25968;&#65292;&#21017;&#30452;&#25509;&#20351;&#29992;puts</span>
 <span style="color: #F92672;">804852f</span>:   83 c4 10                add    $0x10,<span style="color: #FD971F;">%esp</span>              <span style="color: #75715E;">; </span><span style="color: #E6DB74;">esp = esp + 0x10&#65292;&#24674;&#22797;esp&#65292;&#20854;&#23454;esp = esp - 0xc&#38750;&#24517;&#39035;&#65292;&#21487;&#20197;&#30452;&#25509;push&#26368;&#21518;esp = esp + 4</span>
    }

    <span style="color: #F92672;">return</span> 1<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048532</span>:   b8 01 00 00 00          mov    $0x1,<span style="color: #FD971F;">%eax</span>               <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#36820;&#22238;&#20540;&#20540;&#20026;1</span>
}
 <span style="color: #F92672;">8048537</span>:   c9                      leave
 <span style="color: #F92672;">8048538</span>:   c3                      ret

<span style="color: #A6E22E; font-size: 130%;">08048539</span> &lt;func3&gt;:

<span style="color: #75715E;">//</span><span style="color: #E6DB74;">switch case</span>
<span style="color: #A6E22E; font-size: 130%;">int</span> <span style="color: #F92672;">func3</span>(int i)
{
 <span style="color: #F92672;">8048539</span>:   55                      push   <span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">804853a</span>:   89 e5                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">804853c</span>:   83 ec 18                sub    $0x18,<span style="color: #FD971F;">%esp</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#24320;&#26632;</span>
    <span style="color: #F92672;">int</span> rc = -1<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">804853f</span>:   c7 45 f4 ff ff ff ff    movl   $0xffffffff,-0xc(<span style="color: #FD971F;">%ebp</span>) <span style="color: #75715E;">; </span><span style="color: #E6DB74;">rc = -1</span>

    <span style="color: #F92672;">switch</span> (i) {
 <span style="color: #F92672;">8048546</span>:   83 7d 08 02             cmpl   $0x2,0x8(<span style="color: #FD971F;">%ebp</span>)         <span style="color: #75715E;">; </span><span style="color: #E6DB74;">i&#21644;0x2&#27604;&#36739;</span>
 <span style="color: #F92672;">804854a</span>:   74 16                   je     8048562 &lt;func3+0x29&gt;   <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#30456;&#31561;&#36339;&#36716;8048562</span>
 <span style="color: #F92672;">804854c</span>:   83 7d 08 0f             cmpl   $0xf,0x8(<span style="color: #FD971F;">%ebp</span>)         <span style="color: #75715E;">; </span><span style="color: #E6DB74;">i&#21644;0xf&#27604;&#36739;</span>
 <span style="color: #F92672;">8048550</span>:   74 19                   je     804856b &lt;func3+0x32&gt;   <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#30456;&#31561;&#36339;&#36716;804856b</span>
 <span style="color: #F92672;">8048552</span>:   83 7d 08 01             cmpl   $0x1,0x8(<span style="color: #FD971F;">%ebp</span>)         <span style="color: #75715E;">; </span><span style="color: #E6DB74;">i&#21644;0x1&#27604;&#36739;</span>
 <span style="color: #F92672;">8048556</span>:   75 25                   jne    804857d &lt;func3+0x44&gt;   <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#19981;&#31561;&#21017;&#36339;&#36716;804857d</span>
    <span style="color: #F92672;">case</span> 1:
        <span style="color: #F92672;">rc</span> = global_uninit_var<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048558</span>:   a1 2c a0 04 08          mov    0x804a02c,<span style="color: #FD971F;">%eax</span>         <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#30456;&#31561;&#21363;&#21040;&#36825;&#37324;, eax = global_uninit_var = *0x804a02c, *&#27880;&#24847;&#36825;&#37324;&#19981;&#26159;$0x804a02c&#65292;&#25152;&#20197;&#19981;&#26159;&#31435;&#21363;&#25968;&#65292;&#32780;&#26159;[0x804a02c]*</span>
 <span style="color: #F92672;">804855d</span>:   89 45 f4                mov    <span style="color: #FD971F;">%eax</span>,-0xc(<span style="color: #FD971F;">%ebp</span>)        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">rc = *(ebp - 0xc) = eax</span>
        <span style="color: #F92672;">break</span><span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048560</span>:   eb 1c                   jmp    804857e &lt;func3+0x45&gt;   <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#36339;&#36716;&#33267;&#26411;&#23614;</span>
    <span style="color: #F92672;">case</span> 2:
        <span style="color: #F92672;">rc</span> = 8<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048562</span>:   c7 45 f4 08 00 00 00    movl   $0x8,-0xc(<span style="color: #FD971F;">%ebp</span>)        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">rc = 8;</span>
        <span style="color: #F92672;">break</span><span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048569</span>:   eb 13                   jmp    804857e &lt;func3+0x45&gt;   <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#36339;&#36716;&#33267;&#26411;&#23614;</span>
    <span style="color: #F92672;">case</span> 15:
        <span style="color: #F92672;">printf</span>(<span style="color: #E6DB74;">"i == 15"</span>)<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">804856b</span>:   83 ec 0c                sub    $0xc,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">804856e</span>:   68 63 87 04 08          push   $0x8048763
 <span style="color: #F92672;">8048573</span>:   e8 f8 fd ff ff          call   8048370 <a href="mailto:printf%40plt">&lt;printf@plt&gt;</a>
 <span style="color: #F92672;">8048578</span>:   83 c4 10                add    $0x10,<span style="color: #FD971F;">%esp</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">printf</span>
        <span style="color: #F92672;">break</span><span style="color: #75715E;">;</span>
 <span style="color: #F92672;">804857b</span>:   eb 01                   jmp    804857e &lt;func3+0x45&gt;
    <span style="color: #F92672;">default</span>:
        <span style="color: #F92672;">break</span><span style="color: #75715E;">;</span>
 <span style="color: #F92672;">804857d</span>:   90                      nop                           <span style="color: #75715E;">; </span><span style="color: #E6DB74;">nothing</span>
    }
    <span style="color: #F92672;">return</span> rc<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">804857e</span>:   8b 45 f4                mov    -0xc(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = rc</span>
}
 <span style="color: #F92672;">8048581</span>:   c9                      leave
 <span style="color: #F92672;">8048582</span>:   c3                      ret

<span style="color: #A6E22E; font-size: 130%;">08048583</span> &lt;func4&gt;:


<span style="color: #75715E;">//</span><span style="color: #E6DB74;">loop</span>
<span style="color: #A6E22E; font-size: 130%;">int</span> <span style="color: #F92672;">func4</span>(int bound)
{
 <span style="color: #F92672;">8048583</span>:   55                      push   <span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">8048584</span>:   89 e5                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">8048586</span>:   83 ec 10                sub    $0x10,<span style="color: #FD971F;">%esp</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#24320;&#26632;</span>
    <span style="color: #F92672;">int</span> i, sum = 0<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048589</span>:   c7 45 f8 00 00 00 00    movl   $0x0,-0x8(<span style="color: #FD971F;">%ebp</span>)        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">sum = *(ebp - 8) = 0</span>

    <span style="color: #F92672;">for</span> (i = 0<span style="color: #75715E;">; </span><span style="color: #E6DB74;">i &lt; bound; ++i) {</span>
 <span style="color: #F92672;">8048590</span>:   c7 45 fc 00 00 00 00    movl   $0x0,-0x4(<span style="color: #FD971F;">%ebp</span>)        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">i = *(ebp - 4) = 0</span>
 <span style="color: #F92672;">8048597</span>:   eb 0a                   jmp    80485a3 &lt;func4+0x20&gt;   <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#36339;&#36716;</span>
        <span style="color: #F92672;">sum</span> += i<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048599</span>:   8b 45 fc                mov    -0x4(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = i</span>
 <span style="color: #F92672;">804859c</span>:   01 45 f8                add    <span style="color: #FD971F;">%eax</span>,-0x8(<span style="color: #FD971F;">%ebp</span>)        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">sum += eax</span>
    <span style="color: #F92672;">for</span> (i = 0<span style="color: #75715E;">; </span><span style="color: #E6DB74;">i &lt; bound; ++i) {</span>
 <span style="color: #F92672;">804859f</span>:   83 45 fc 01             addl   $0x1,-0x4(<span style="color: #FD971F;">%ebp</span>)        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">i += 1</span>
 <span style="color: #F92672;">80485a3</span>:   8b 45 fc                mov    -0x4(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = *(ebp - 4)</span>
 <span style="color: #F92672;">80485a6</span>:   3b 45 08                cmp    0x8(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>         <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#27604;&#36739; eax&#21644;sum</span>
 <span style="color: #F92672;">80485a9</span>:   7c ee                   jl     8048599 &lt;func4+0x16&gt;   <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#23569;&#20110;&#21017;&#36339;&#36716;&#33267;8048599</span>
    }

    <span style="color: #F92672;">return</span> sum<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">80485ab</span>:   8b 45 f8                mov    -0x8(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = sum</span>
}
 <span style="color: #F92672;">80485ae</span>:   c9                      leave
 <span style="color: #F92672;">80485af</span>:   c3                      ret

<span style="color: #A6E22E; font-size: 130%;">080485b0</span> &lt;func5&gt;:

<span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#19981;&#23450;&#21442;</span>
<span style="color: #A6E22E; font-size: 130%;">int</span> <span style="color: #F92672;">func5</span>(int count, ...)
{
 <span style="color: #F92672;">80485b0</span>:   55                      push   <span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">80485b1</span>:   89 e5                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">80485b3</span>:   83 ec 10                sub    $0x10,<span style="color: #FD971F;">%esp</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#24320;&#26632;</span>
    <span style="color: #F92672;">va_list</span> argp<span style="color: #75715E;">;</span>
    <span style="color: #F92672;">int</span> i, sum = 0<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">80485b6</span>:   c7 45 f8 00 00 00 00    movl   $0x0,-0x8(<span style="color: #FD971F;">%ebp</span>)        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">sum = *(ebp - 8) = 0</span>

    <span style="color: #F92672;">va_start</span>(argp, count)<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">80485bd</span>:   8d 45 0c                lea    0xc(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>         <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = ebp + 0xc = &amp;count</span>
 <span style="color: #F92672;">80485c0</span>:   89 45 f4                mov    <span style="color: #FD971F;">%eax</span>,-0xc(<span style="color: #FD971F;">%ebp</span>)        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">argp = ebp - 0xc = eax</span>
    <span style="color: #F92672;">for</span> (i = 0<span style="color: #75715E;">; </span><span style="color: #E6DB74;">i &lt; count; ++i) {</span>
 <span style="color: #F92672;">80485c3</span>:   c7 45 fc 00 00 00 00    movl   $0x0,-0x4(<span style="color: #FD971F;">%ebp</span>)        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">i = *(ebp - 0x4) = 0</span>
 <span style="color: #F92672;">80485ca</span>:   eb 12                   jmp    80485de &lt;func5+0x2e&gt;   <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#36339;&#33267;0x80485de</span>
        <span style="color: #F92672;">sum</span> += va_arg(argp, int)<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">80485cc</span>:   8b 45 f4                mov    -0xc(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = argp</span>
 <span style="color: #F92672;">80485cf</span>:   8d 50 04                lea    0x4(<span style="color: #FD971F;">%eax</span>),<span style="color: #FD971F;">%edx</span>         <span style="color: #75715E;">; </span><span style="color: #E6DB74;">edx = eax + 4</span>
 <span style="color: #F92672;">80485d2</span>:   89 55 f4                mov    <span style="color: #FD971F;">%edx</span>,-0xc(<span style="color: #FD971F;">%ebp</span>)        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">argp = edx</span>
 <span style="color: #F92672;">80485d5</span>:   8b 00                   mov    (<span style="color: #FD971F;">%eax</span>),<span style="color: #FD971F;">%eax</span>            <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = *(eax)</span>
 <span style="color: #F92672;">80485d7</span>:   01 45 f8                add    <span style="color: #FD971F;">%eax</span>,-0x8(<span style="color: #FD971F;">%ebp</span>)        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">sum = *(ebp - 0x8) + eax</span>
    <span style="color: #F92672;">for</span> (i = 0<span style="color: #75715E;">; </span><span style="color: #E6DB74;">i &lt; count; ++i) {</span>
 <span style="color: #F92672;">80485da</span>:   83 45 fc 01             addl   $0x1,-0x4(<span style="color: #FD971F;">%ebp</span>)        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">i = i + 1</span>
 <span style="color: #F92672;">80485de</span>:   8b 45 fc                mov    -0x4(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = *(ebp - 0x4)</span>
 <span style="color: #F92672;">80485e1</span>:   3b 45 08                cmp    0x8(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>         <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#27604;&#36739;eax&#21644;count = *(ebp + 0x8)</span>
 <span style="color: #F92672;">80485e4</span>:   7c e6                   jl     80485cc &lt;func5+0x1c&gt;   <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#36339;&#33267;80485cc</span>
    }
    <span style="color: #F92672;">va_end</span>(argp)<span style="color: #75715E;">;</span>
    <span style="color: #F92672;">return</span> sum<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">80485e6</span>:   8b 45 f8                mov    -0x8(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = sum = *(ebp - 0x8)</span>
}
 <span style="color: #F92672;">80485e9</span>:   c9                      leave                         <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#20986;&#26632;</span>
 <span style="color: #F92672;">80485ea</span>:   c3                      ret

<span style="color: #A6E22E; font-size: 130%;">080485eb</span> &lt;func6&gt;:

<span style="color: #A6E22E; font-size: 130%;">void</span> <span style="color: #F92672;">func6</span>(void)
{
 <span style="color: #F92672;">80485eb</span>:   55                      push   <span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">80485ec</span>:   89 e5                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">80485ee</span>:   83 ec 20                sub    $0x20,<span style="color: #FD971F;">%esp</span>
    <span style="color: #F92672;">int</span> i = 1<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">80485f1</span>:   c7 45 fc 01 00 00 00    movl   $0x1,-0x4(<span style="color: #FD971F;">%ebp</span>)
    <span style="color: #F92672;">int</span> j = 1<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">80485f8</span>:   c7 45 f8 01 00 00 00    movl   $0x1,-0x8(<span style="color: #FD971F;">%ebp</span>)
    <span style="color: #F92672;">int</span> k = 1<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">80485ff</span>:   c7 45 f4 01 00 00 00    movl   $0x1,-0xc(<span style="color: #FD971F;">%ebp</span>)
    <span style="color: #F92672;">int</span> l = 1<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048606</span>:   c7 45 f0 01 00 00 00    movl   $0x1,-0x10(<span style="color: #FD971F;">%ebp</span>)
    <span style="color: #F92672;">int</span> m = 1<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">804860d</span>:   c7 45 ec 01 00 00 00    movl   $0x1,-0x14(<span style="color: #FD971F;">%ebp</span>)
    <span style="color: #F92672;">int</span> n = 1<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048614</span>:   c7 45 e8 01 00 00 00    movl   $0x1,-0x18(<span style="color: #FD971F;">%ebp</span>)

    <span style="color: #F92672;">return</span><span style="color: #75715E;">;</span>
 <span style="color: #F92672;">804861b</span>:   90                      nop
}
 <span style="color: #F92672;">804861c</span>:   c9                      leave
 <span style="color: #F92672;">804861d</span>:   c3                      ret

<span style="color: #A6E22E; font-size: 130%;">0804861e</span> &lt;main&gt;:

<span style="color: #A6E22E; font-size: 130%;">int</span> <span style="color: #F92672;">main</span>(int argc, char *argv[])
{
 <span style="color: #F92672;">804861e</span>:   8d 4c 24 04             lea    0x4(<span style="color: #FD971F;">%esp</span>),<span style="color: #FD971F;">%ecx</span>     <span style="color: #75715E;">; </span><span style="color: #E6DB74;">ecx = &amp;(esp + 0x4), &#21363;&amp;argc</span>
 <span style="color: #F92672;">8048622</span>:   83 e4 f0                and    $0xfffffff0,<span style="color: #FD971F;">%esp</span>   <span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048625</span>:   ff 71 fc                pushl  -0x4(<span style="color: #FD971F;">%ecx</span>)         <span style="color: #75715E;">; </span><span style="color: #E6DB74;">push *(ecx - 4) = *(prev esp)</span>
 <span style="color: #F92672;">8048628</span>:   55                      push   <span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">8048629</span>:   89 e5                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">804862b</span>:   53                      push   <span style="color: #FD971F;">%ebx</span>
 <span style="color: #F92672;">804862c</span>:   51                      push   <span style="color: #FD971F;">%ecx</span>
 <span style="color: #F92672;">804862d</span>:   83 ec 20                sub    $0x20,<span style="color: #FD971F;">%esp</span>         <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#24320;&#26632;</span>
 <span style="color: #F92672;">8048630</span>:   89 cb                   mov    <span style="color: #FD971F;">%ecx</span>,<span style="color: #FD971F;">%ebx</span>          <span style="color: #75715E;">; </span><span style="color: #E6DB74;">ebx = ecx, *ecx&#26159;argc, &amp;argv&#26159;&amp;argc + sizeof(void *)</span>
    <span style="color: #F92672;">struct</span> s1 s1 = {
 <span style="color: #F92672;">8048632</span>:   c7 45 ec 01 00 00 00    movl   $0x1,-0x14(<span style="color: #FD971F;">%ebp</span>)
 <span style="color: #F92672;">8048639</span>:   c7 45 f0 02 00 00 00    movl   $0x2,-0x10(<span style="color: #FD971F;">%ebp</span>)
 <span style="color: #F92672;">8048640</span>:   c7 45 f4 03 00 00 00    movl   $0x3,-0xc(<span style="color: #FD971F;">%ebp</span>)
        <span style="color: #F92672;">.a</span> = 1,
        <span style="color: #F92672;">.b</span> = 2,
        <span style="color: #F92672;">.c</span> = 3,
    }<span style="color: #75715E;">;</span>

    <span style="color: #F92672;">struct</span> s2 s2 = {
 <span style="color: #F92672;">8048647</span>:   c7 45 e4 6b 87 04 08    movl   $0x804876b,-0x1c(<span style="color: #FD971F;">%ebp</span>)
 <span style="color: #F92672;">804864e</span>:   c7 45 e8 0f 00 00 00    movl   $0xf,-0x18(<span style="color: #FD971F;">%ebp</span>)
        <span style="color: #F92672;">.a</span> = <span style="color: #E6DB74;">"hello"</span>,
        <span style="color: #F92672;">.b</span> = 15,
    }<span style="color: #75715E;">;</span>

    <span style="color: #F92672;">func1</span>(argc, &amp;s1, &amp;s2)<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048655</span>:   8d 45 e4                lea    -0x1c(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>
 <span style="color: #F92672;">8048658</span>:   50                      push   <span style="color: #FD971F;">%eax</span>
 <span style="color: #F92672;">8048659</span>:   8d 45 ec                lea    -0x14(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>
 <span style="color: #F92672;">804865c</span>:   50                      push   <span style="color: #FD971F;">%eax</span>
 <span style="color: #F92672;">804865d</span>:   ff 33                   pushl  (<span style="color: #FD971F;">%ebx</span>)             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">push argc</span>
 <span style="color: #F92672;">804865f</span>:   e8 79 fe ff ff          call   80484dd &lt;func1&gt;
 <span style="color: #F92672;">8048664</span>:   83 c4 0c                add    $0xc,<span style="color: #FD971F;">%esp</span>
    <span style="color: #F92672;">func2</span>(argc)<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048667</span>:   83 ec 0c                sub    $0xc,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">804866a</span>:   ff 33                   pushl  (<span style="color: #FD971F;">%ebx</span>)
 <span style="color: #F92672;">804866c</span>:   e8 9e fe ff ff          call   804850f &lt;func2&gt;
 <span style="color: #F92672;">8048671</span>:   83 c4 10                add    $0x10,<span style="color: #FD971F;">%esp</span>
    <span style="color: #F92672;">func3</span>(argc)<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048674</span>:   83 ec 0c                sub    $0xc,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">8048677</span>:   ff 33                   pushl  (<span style="color: #FD971F;">%ebx</span>)
 <span style="color: #F92672;">8048679</span>:   e8 bb fe ff ff          call   8048539 &lt;func3&gt;
 <span style="color: #F92672;">804867e</span>:   83 c4 10                add    $0x10,<span style="color: #FD971F;">%esp</span>
    <span style="color: #F92672;">func4</span>(argc)<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048681</span>:   83 ec 0c                sub    $0xc,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">8048684</span>:   ff 33                   pushl  (<span style="color: #FD971F;">%ebx</span>)
 <span style="color: #F92672;">8048686</span>:   e8 f8 fe ff ff          call   8048583 &lt;func4&gt;
 <span style="color: #F92672;">804868b</span>:   83 c4 10                add    $0x10,<span style="color: #FD971F;">%esp</span>
    <span style="color: #F92672;">printf</span>(<span style="color: #E6DB74;">"%d\n"</span>, func5(5, 1, 2, 3, 4, 5))<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">804868e</span>:   83 ec 08                sub    $0x8,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">8048691</span>:   6a 05                   push   $0x5
 <span style="color: #F92672;">8048693</span>:   6a 04                   push   $0x4
 <span style="color: #F92672;">8048695</span>:   6a 03                   push   $0x3
 <span style="color: #F92672;">8048697</span>:   6a 02                   push   $0x2
 <span style="color: #F92672;">8048699</span>:   6a 01                   push   $0x1
 <span style="color: #F92672;">804869b</span>:   6a 05                   push   $0x5
 <span style="color: #F92672;">804869d</span>:   e8 0e ff ff ff          call   80485b0 &lt;func5&gt;
 <span style="color: #F92672;">80486a2</span>:   83 c4 20                add    $0x20,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80486a5</span>:   83 ec 08                sub    $0x8,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80486a8</span>:   50                      push   <span style="color: #FD971F;">%eax</span>
 <span style="color: #F92672;">80486a9</span>:   68 71 87 04 08          push   $0x8048771
 <span style="color: #F92672;">80486ae</span>:   e8 bd fc ff ff          call   8048370 <a href="mailto:printf%40plt">&lt;printf@plt&gt;</a>
 <span style="color: #F92672;">80486b3</span>:   83 c4 10                add    $0x10,<span style="color: #FD971F;">%esp</span>
    <span style="color: #F92672;">func6</span>()<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">80486b6</span>:   e8 30 ff ff ff          call   80485eb &lt;func6&gt;
    <span style="color: #F92672;">return</span> 0<span style="color: #75715E;">;</span>
 <span style="color: #F92672;">80486bb</span>:   b8 00 00 00 00          mov    $0x0,<span style="color: #FD971F;">%eax</span>
}
 <span style="color: #F92672;">80486c0</span>:   8d 65 f8                lea    -0x8(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80486c3</span>:   59                      pop    <span style="color: #FD971F;">%ecx</span>
 <span style="color: #F92672;">80486c4</span>:   5b                      pop    <span style="color: #FD971F;">%ebx</span>
 <span style="color: #F92672;">80486c5</span>:   5d                      pop    <span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">80486c6</span>:   8d 61 fc                lea    -0x4(<span style="color: #FD971F;">%ecx</span>),<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80486c9</span>:   c3                      ret
 <span style="color: #F92672;">80486ca</span>:   66 90                   xchg   <span style="color: #FD971F;">%ax</span>,<span style="color: #FD971F;">%ax</span>
 <span style="color: #F92672;">80486cc</span>:   66 90                   xchg   <span style="color: #FD971F;">%ax</span>,<span style="color: #FD971F;">%ax</span>
 <span style="color: #F92672;">80486ce</span>:   66 90                   xchg   <span style="color: #FD971F;">%ax</span>,<span style="color: #FD971F;">%ax</span>
</pre>
</div>

<p>
<b>gcc -m32 -O2 foo.c</b><br />
</p>
<div class="org-src-container">
<pre class="src src-asm">
<span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#32534;&#35793;&#22120;&#23545;main&#30340;&#20248;&#21270;</span>
<span style="color: #75715E;">; </span><span style="color: #E6DB74;">- func1 &#26080;&#20219;&#20309;&#36755;&#20986;</span>
<span style="color: #75715E;">; </span><span style="color: #E6DB74;">- func2 &#22914;&#26524;i&#38750;0&#65292;&#21017;&#36755;&#20986;"1&lt;= i\n"&#65292;&#22240;&#20026;&#20026;&#30830;&#23450;&#20540;&#65292;&#25152;&#20197;&#30452;&#25509;&#20869;&#32852;</span>
<span style="color: #A6E22E; font-size: 130%;">Disassembly</span> <span style="color: #F92672;">of</span> section .text:

<span style="color: #A6E22E; font-size: 130%;">080483a0</span> &lt;main&gt;:
 <span style="color: #F92672;">80483a0</span>:   8d 4c 24 04             lea    0x4(<span style="color: #FD971F;">%esp</span>),<span style="color: #FD971F;">%ecx</span>      <span style="color: #75715E;">; </span><span style="color: #E6DB74;">ecx = &amp;argc</span>
 <span style="color: #F92672;">80483a4</span>:   83 e4 f0                and    $0xfffffff0,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80483a7</span>:   ff 71 fc                pushl  -0x4(<span style="color: #FD971F;">%ecx</span>)          <span style="color: #75715E;">; </span><span style="color: #E6DB74;">push *(ecx - 4) = *(prev esp)</span>
 <span style="color: #F92672;">80483aa</span>:   55                      push   <span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">80483ab</span>:   89 e5                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">80483ad</span>:   53                      push   <span style="color: #FD971F;">%ebx</span>
 <span style="color: #F92672;">80483ae</span>:   8b 19                   mov    (<span style="color: #FD971F;">%ecx</span>),<span style="color: #FD971F;">%ebx</span>         <span style="color: #75715E;">; </span><span style="color: #E6DB74;">ebx = *ecx = argc</span>
 <span style="color: #F92672;">80483b0</span>:   51                      push   <span style="color: #FD971F;">%ecx</span>
 <span style="color: #F92672;">80483b1</span>:   85 db                   test   <span style="color: #FD971F;">%ebx</span>,<span style="color: #FD971F;">%ebx</span>           <span style="color: #75715E;">; </span><span style="color: #E6DB74;">ebx&#38750;0&#21017;&#19981;&#25191;&#34892;puts("1 &lt;= i\n")</span>
 <span style="color: #F92672;">80483b3</span>:   7e 10                   jle    80483c5 &lt;main+0x25&gt;
 <span style="color: #F92672;">80483b5</span>:   83 ec 0c                sub    $0xc,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80483b8</span>:   68 ec 86 04 08          push   $0x80486ec
 <span style="color: #F92672;">80483bd</span>:   e8 be ff ff ff          call   8048380 <a href="mailto:puts%40plt">&lt;puts@plt&gt;</a>
 <span style="color: #F92672;">80483c2</span>:   83 c4 10                add    $0x10,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80483c5</span>:   83 ec 0c                sub    $0xc,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80483c8</span>:   53                      push   <span style="color: #FD971F;">%ebx</span>                <span style="color: #75715E;">; </span><span style="color: #E6DB74;">push i = argc</span>
 <span style="color: #F92672;">80483c9</span>:   e8 d2 01 00 00          call   80485a0 &lt;func3&gt;
 <span style="color: #F92672;">80483ce</span>:   58                      pop    <span style="color: #FD971F;">%eax</span>
 <span style="color: #F92672;">80483cf</span>:   5a                      pop    <span style="color: #FD971F;">%edx</span>
 <span style="color: #F92672;">80483d0</span>:   6a 05                   push   $0x5
 <span style="color: #F92672;">80483d2</span>:   6a 04                   push   $0x4
 <span style="color: #F92672;">80483d4</span>:   6a 03                   push   $0x3
 <span style="color: #F92672;">80483d6</span>:   6a 02                   push   $0x2
 <span style="color: #F92672;">80483d8</span>:   6a 01                   push   $0x1
 <span style="color: #F92672;">80483da</span>:   6a 05                   push   $0x5
 <span style="color: #F92672;">80483dc</span>:   e8 3f 02 00 00          call   8048620 &lt;func5&gt;     <span style="color: #75715E;">; </span><span style="color: #E6DB74;">call fun5</span>
 <span style="color: #F92672;">80483e1</span>:   83 c4 18                add    $0x18,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80483e4</span>:   50                      push   <span style="color: #FD971F;">%eax</span>
 <span style="color: #F92672;">80483e5</span>:   68 fb 86 04 08          push   $0x80486fb
 <span style="color: #F92672;">80483ea</span>:   e8 81 ff ff ff          call   8048370 <a href="mailto:printf%40plt">&lt;printf@plt&gt;</a> <span style="color: #75715E;">; </span><span style="color: #E6DB74;">print</span>
 <span style="color: #F92672;">80483ef</span>:   83 c4 10                add    $0x10,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80483f2</span>:   8d 65 f8                lea    -0x8(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80483f5</span>:   31 c0                   xor    <span style="color: #FD971F;">%eax</span>,<span style="color: #FD971F;">%eax</span>
 <span style="color: #F92672;">80483f7</span>:   59                      pop    <span style="color: #FD971F;">%ecx</span>
 <span style="color: #F92672;">80483f8</span>:   5b                      pop    <span style="color: #FD971F;">%ebx</span>
 <span style="color: #F92672;">80483f9</span>:   5d                      pop    <span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">80483fa</span>:   8d 61 fc                lea    -0x4(<span style="color: #FD971F;">%ecx</span>),<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80483fd</span>:   c3                      ret

<span style="color: #A6E22E; font-size: 130%;">08048540</span> &lt;func1&gt;:
 <span style="color: #F92672;">8048540</span>:   8b 44 24 0c             mov    0xc(<span style="color: #FD971F;">%esp</span>),<span style="color: #FD971F;">%eax</span>        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = s2</span>
 <span style="color: #F92672;">8048544</span>:   8b 50 04                mov    0x4(<span style="color: #FD971F;">%eax</span>),<span style="color: #FD971F;">%edx</span>        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">edx = s2-&gt;b</span>
 <span style="color: #F92672;">8048547</span>:   8b 44 24 08             mov    0x8(<span style="color: #FD971F;">%esp</span>),<span style="color: #FD971F;">%eax</span>        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = s1</span>
 <span style="color: #F92672;">804854b</span>:   89 50 08                mov    <span style="color: #FD971F;">%edx</span>,0x8(<span style="color: #FD971F;">%eax</span>)        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">s1-&gt;c = edx = s2-&gt;b</span>
 <span style="color: #F92672;">804854e</span>:   8b 44 24 04             mov    0x4(<span style="color: #FD971F;">%esp</span>),<span style="color: #FD971F;">%eax</span>        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = i</span>
 <span style="color: #F92672;">8048552</span>:   83 c0 56                add    $0x56,<span style="color: #FD971F;">%eax</span>            <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = i + 0x56, *&#39318;&#20808;static_var2&#24182;&#27809;&#26377;&#20154;&#29992;&#65292;&#25152;&#20197;&#32534;&#35793;&#35748;&#20026;&#26159;0&#65292;&#20854;&#23454;a&#27704;&#36828;&#20026;1&#25152;&#20197;static_var + 1= 85 + 1 = 0x56*</span>
 <span style="color: #F92672;">8048555</span>:   c3                      ret
 <span style="color: #F92672;">8048556</span>:   8d 76 00                lea    0x0(<span style="color: #FD971F;">%esi</span>),<span style="color: #FD971F;">%esi</span>
 <span style="color: #F92672;">8048559</span>:   8d bc 27 00 00 00 00    lea    0x0(<span style="color: #FD971F;">%edi</span>,<span style="color: #FD971F;">%eiz</span>,1),<span style="color: #FD971F;">%edi</span>

<span style="color: #A6E22E; font-size: 130%;">08048560</span> &lt;func2&gt;:
 <span style="color: #F92672;">8048560</span>:   83 ec 0c                sub    $0xc,<span style="color: #FD971F;">%esp</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">esp = esp - 0xc</span>
 <span style="color: #F92672;">8048563</span>:   8b 44 24 10             mov    0x10(<span style="color: #FD971F;">%esp</span>),<span style="color: #FD971F;">%eax</span>       <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = *(esp + 0x10) = i</span>
 <span style="color: #F92672;">8048567</span>:   85 c0                   test   <span style="color: #FD971F;">%eax</span>,<span style="color: #FD971F;">%eax</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#21028;&#26029;&#26159;&#21542;&#20026;0</span>
 <span style="color: #F92672;">8048569</span>:   7e 1d                   jle    8048588 &lt;func2+0x28&gt;  <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#23567;&#20110;&#36339;&#36716;</span>
 <span style="color: #F92672;">804856b</span>:   83 ec 0c                sub    $0xc,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">804856e</span>:   68 ec 86 04 08          push   $0x80486ec
 <span style="color: #F92672;">8048573</span>:   e8 08 fe ff ff          call   8048380 <a href="mailto:puts%40plt">&lt;puts@plt&gt;</a>
 <span style="color: #F92672;">8048578</span>:   83 c4 10                add    $0x10,<span style="color: #FD971F;">%esp</span>            <span style="color: #75715E;">; </span><span style="color: #E6DB74;">puts("1 &lt;= i\n")</span>
 <span style="color: #F92672;">804857b</span>:   b8 01 00 00 00          mov    $0x1,<span style="color: #FD971F;">%eax</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#36820;&#22238;&#20540;1</span>
 <span style="color: #F92672;">8048580</span>:   83 c4 0c                add    $0xc,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">8048583</span>:   c3                      ret
 <span style="color: #F92672;">8048584</span>:   8d 74 26 00             lea    0x0(<span style="color: #FD971F;">%esi</span>,<span style="color: #FD971F;">%eiz</span>,1),<span style="color: #FD971F;">%esi</span>
 <span style="color: #F92672;">8048588</span>:   b8 03 00 00 00          mov    $0x3,<span style="color: #FD971F;">%eax</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#36820;&#22238;&#20540;3</span>
 <span style="color: #F92672;">804858d</span>:   83 c4 0c                add    $0xc,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">8048590</span>:   c3                      ret
 <span style="color: #F92672;">8048591</span>:   eb 0d                   jmp    80485a0 &lt;func3&gt;
 <span style="color: #F92672;">8048593</span>:   90                      nop
 <span style="color: #F92672;">8048594</span>:   90                      nop
 <span style="color: #F92672;">8048595</span>:   90                      nop
 <span style="color: #F92672;">8048596</span>:   90                      nop
 <span style="color: #F92672;">8048597</span>:   90                      nop
 <span style="color: #F92672;">8048598</span>:   90                      nop
 <span style="color: #F92672;">8048599</span>:   90                      nop
 <span style="color: #F92672;">804859a</span>:   90                      nop
 <span style="color: #F92672;">804859b</span>:   90                      nop
 <span style="color: #F92672;">804859c</span>:   90                      nop
 <span style="color: #F92672;">804859d</span>:   90                      nop
 <span style="color: #F92672;">804859e</span>:   90                      nop
 <span style="color: #F92672;">804859f</span>:   90                      nop

<span style="color: #A6E22E; font-size: 130%;">080485a0</span> &lt;func3&gt;:
 <span style="color: #F92672;">80485a0</span>:   83 ec 0c                sub    $0xc,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80485a3</span>:   b8 08 00 00 00          mov    $0x8,<span style="color: #FD971F;">%eax</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#36820;&#22238;&#20540;8&#20808;&#36171;&#20540;&#22909;</span>
 <span style="color: #F92672;">80485a8</span>:   8b 54 24 10             mov    0x10(<span style="color: #FD971F;">%esp</span>),<span style="color: #FD971F;">%edx</span>       <span style="color: #75715E;">; </span><span style="color: #E6DB74;">edx = &#20837;&#21442;i</span>
 <span style="color: #F92672;">80485ac</span>:   83 fa 02                cmp    $0x2,<span style="color: #FD971F;">%edx</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#21644;2&#27604;&#36739;</span>
 <span style="color: #F92672;">80485af</span>:   74 14                   je     80485c5 &lt;func3+0x25&gt;  <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#30456;&#31561;&#26102;&#20986;&#26632;</span>
 <span style="color: #F92672;">80485b1</span>:   83 fa 0f                cmp    $0xf,<span style="color: #FD971F;">%edx</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#21644;0xf&#27604;&#36739;</span>
 <span style="color: #F92672;">80485b4</span>:   74 1a                   je     80485d0 &lt;func3+0x30&gt;  <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#30456;&#31561;&#26102;&#36339;&#36716;</span>
 <span style="color: #F92672;">80485b6</span>:   83 fa 01                cmp    $0x1,<span style="color: #FD971F;">%edx</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#21644;1&#27604;&#36739;</span>
 <span style="color: #F92672;">80485b9</span>:   b8 ff ff ff ff          mov    $0xffffffff,<span style="color: #FD971F;">%eax</span>
 <span style="color: #F92672;">80485be</span>:   0f 44 05 24 a0 04 08    cmove  0x804a024,<span style="color: #FD971F;">%eax</span>        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">rc = global_uninit_var</span>
 <span style="color: #F92672;">80485c5</span>:   83 c4 0c                add    $0xc,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80485c8</span>:   c3                      ret
 <span style="color: #F92672;">80485c9</span>:   8d b4 26 00 00 00 00    lea    0x0(<span style="color: #FD971F;">%esi</span>,<span style="color: #FD971F;">%eiz</span>,1),<span style="color: #FD971F;">%esi</span>
 <span style="color: #F92672;">80485d0</span>:   83 ec 0c                sub    $0xc,<span style="color: #FD971F;">%esp</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">i == 15,&#25191;&#34892;puts&#65292;&#36820;&#22238;-1</span>
 <span style="color: #F92672;">80485d3</span>:   68 f3 86 04 08          push   $0x80486f3
 <span style="color: #F92672;">80485d8</span>:   e8 93 fd ff ff          call   8048370 <a href="mailto:printf%40plt">&lt;printf@plt&gt;</a>
 <span style="color: #F92672;">80485dd</span>:   83 c4 10                add    $0x10,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80485e0</span>:   b8 ff ff ff ff          mov    $0xffffffff,<span style="color: #FD971F;">%eax</span>
 <span style="color: #F92672;">80485e5</span>:   83 c4 0c                add    $0xc,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">80485e8</span>:   c3                      ret
 <span style="color: #F92672;">80485e9</span>:   8d b4 26 00 00 00 00    lea    0x0(<span style="color: #FD971F;">%esi</span>,<span style="color: #FD971F;">%eiz</span>,1),<span style="color: #FD971F;">%esi</span>

<span style="color: #A6E22E; font-size: 130%;">080485f0</span> &lt;func4&gt;:
<span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#32534;&#35793;&#22120;&#20248;&#21270;&#21518;&#65292;&#24182;&#27809;&#26377;&#23616;&#37096;&#21464;&#37327;i&#65292;eax&#21363;&#20026;sum&#65292;edx&#29992;&#20316;i&#30340;&#20316;&#29992;&#65292;&#27599;&#20010;loop edx&#21644;bound&#27604;&#65292;&#21516;&#26102;&#23558;edx&#21152;&#21040;&#36820;&#22238;&#20540;eax&#20013;</span>
 <span style="color: #F92672;">80485f0</span>:   8b 4c 24 04             mov    0x4(<span style="color: #FD971F;">%esp</span>),<span style="color: #FD971F;">%ecx</span>        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">ecx = bound</span>
 <span style="color: #F92672;">80485f4</span>:   31 c0                   xor    <span style="color: #FD971F;">%eax</span>,<span style="color: #FD971F;">%eax</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = 0</span>
 <span style="color: #F92672;">80485f6</span>:   85 c9                   test   <span style="color: #FD971F;">%ecx</span>,<span style="color: #FD971F;">%ecx</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">ecx = 0 ?</span>
 <span style="color: #F92672;">80485f8</span>:   7e 16                   jle    8048610 &lt;func4+0x20&gt;  <span style="color: #75715E;">; </span><span style="color: #E6DB74;">bound = 0&#21363;&#36864;&#20986;</span>
 <span style="color: #F92672;">80485fa</span>:   31 d2                   xor    <span style="color: #FD971F;">%edx</span>,<span style="color: #FD971F;">%edx</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">edx = 0</span>
 <span style="color: #F92672;">80485fc</span>:   8d 74 26 00             lea    0x0(<span style="color: #FD971F;">%esi</span>,<span style="color: #FD971F;">%eiz</span>,1),<span style="color: #FD971F;">%esi</span> <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#30456;&#24403;&#20110;nop</span>
 <span style="color: #F92672;">8048600</span>:   01 d0                   add    <span style="color: #FD971F;">%edx</span>,<span style="color: #FD971F;">%eax</span>             <span style="color: #75715E;">;</span>
 <span style="color: #F92672;">8048602</span>:   83 c2 01                add    $0x1,<span style="color: #FD971F;">%edx</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">edx = edx + 1</span>
 <span style="color: #F92672;">8048605</span>:   39 d1                   cmp    <span style="color: #FD971F;">%edx</span>,<span style="color: #FD971F;">%ecx</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">edx&#21644;ecx&#27604;&#36739;</span>
 <span style="color: #F92672;">8048607</span>:   75 f7                   jne    8048600 &lt;func4+0x10&gt;  <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#32487;&#32493;&#22238;&#36339;+1</span>
 <span style="color: #F92672;">8048609</span>:   c3                      ret
 <span style="color: #F92672;">804860a</span>:   8d b6 00 00 00 00       lea    0x0(<span style="color: #FD971F;">%esi</span>),<span style="color: #FD971F;">%esi</span>
 <span style="color: #F92672;">8048610</span>:   c3                      ret
 <span style="color: #F92672;">8048611</span>:   eb 0d                   jmp    8048620 &lt;func5&gt;
 <span style="color: #F92672;">8048613</span>:   90                      nop
 <span style="color: #F92672;">8048614</span>:   90                      nop
 <span style="color: #F92672;">8048615</span>:   90                      nop
 <span style="color: #F92672;">8048616</span>:   90                      nop
 <span style="color: #F92672;">8048617</span>:   90                      nop
 <span style="color: #F92672;">8048618</span>:   90                      nop
 <span style="color: #F92672;">8048619</span>:   90                      nop
 <span style="color: #F92672;">804861a</span>:   90                      nop
 <span style="color: #F92672;">804861b</span>:   90                      nop
 <span style="color: #F92672;">804861c</span>:   90                      nop
 <span style="color: #F92672;">804861d</span>:   90                      nop
 <span style="color: #F92672;">804861e</span>:   90                      nop
 <span style="color: #F92672;">804861f</span>:   90                      nop

<span style="color: #A6E22E; font-size: 130%;">08048620</span> &lt;func5&gt;:
 <span style="color: #F92672;">8048620</span>:   8b 4c 24 04             mov    0x4(<span style="color: #FD971F;">%esp</span>),<span style="color: #FD971F;">%ecx</span>        <span style="color: #75715E;">; </span><span style="color: #E6DB74;">ecx = count</span>
 <span style="color: #F92672;">8048624</span>:   31 c0                   xor    <span style="color: #FD971F;">%eax</span>,<span style="color: #FD971F;">%eax</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = 0</span>
 <span style="color: #F92672;">8048626</span>:   85 c9                   test   <span style="color: #FD971F;">%ecx</span>,<span style="color: #FD971F;">%ecx</span>
 <span style="color: #F92672;">8048628</span>:   7e 16                   jle    8048640 &lt;func5+0x20&gt;  <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#20026;0&#21017;&#30452;&#25509;&#36864;&#20986;</span>
 <span style="color: #F92672;">804862a</span>:   31 d2                   xor    <span style="color: #FD971F;">%edx</span>,<span style="color: #FD971F;">%edx</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">edx = 0</span>
 <span style="color: #F92672;">804862c</span>:   8d 74 26 00             lea    0x0(<span style="color: #FD971F;">%esi</span>,<span style="color: #FD971F;">%eiz</span>,1),<span style="color: #FD971F;">%esi</span> <span style="color: #75715E;">; </span><span style="color: #E6DB74;">nop</span>
 <span style="color: #F92672;">8048630</span>:   03 44 94 08             add    0x8(<span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%edx</span>,4),<span style="color: #FD971F;">%eax</span> <span style="color: #75715E;">; </span><span style="color: #E6DB74;">eax = 0x8 + esp + 4 * edx&#65292;&#21363;count&#22320;&#22336;&#19979;&#38754;&#30340;&#19981;&#23450;&#21442;&#65292;&#21152;&#21040;eax&#20013;</span>
 <span style="color: #F92672;">8048634</span>:   83 c2 01                add    $0x1,<span style="color: #FD971F;">%edx</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">edx &#36882;&#22686;</span>
 <span style="color: #F92672;">8048637</span>:   39 d1                   cmp    <span style="color: #FD971F;">%edx</span>,<span style="color: #FD971F;">%ecx</span>             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">edx &lt; count&#21017;&#32487;&#32493;,&#32534;&#35793;&#22120;&#23558; i &lt; count&#20248;&#21270;&#20026;i != count</span>
 <span style="color: #F92672;">8048639</span>:   75 f5                   jne    8048630 &lt;func5+0x10&gt;
 <span style="color: #F92672;">804863b</span>:   c3                      ret
 <span style="color: #F92672;">804863c</span>:   8d 74 26 00             lea    0x0(<span style="color: #FD971F;">%esi</span>,<span style="color: #FD971F;">%eiz</span>,1),<span style="color: #FD971F;">%esi</span>
 <span style="color: #F92672;">8048640</span>:   c3                      ret
 <span style="color: #F92672;">8048641</span>:   eb 0d                   jmp    8048650 &lt;func6&gt;
 <span style="color: #F92672;">8048643</span>:   90                      nop
 <span style="color: #F92672;">8048644</span>:   90                      nop
 <span style="color: #F92672;">8048645</span>:   90                      nop
 <span style="color: #F92672;">8048646</span>:   90                      nop
 <span style="color: #F92672;">8048647</span>:   90                      nop
 <span style="color: #F92672;">8048648</span>:   90                      nop
 <span style="color: #F92672;">8048649</span>:   90                      nop
 <span style="color: #F92672;">804864a</span>:   90                      nop
 <span style="color: #F92672;">804864b</span>:   90                      nop
 <span style="color: #F92672;">804864c</span>:   90                      nop
 <span style="color: #F92672;">804864d</span>:   90                      nop
 <span style="color: #F92672;">804864e</span>:   90                      nop
 <span style="color: #F92672;">804864f</span>:   90                      nop

<span style="color: #A6E22E; font-size: 130%;">08048650</span> &lt;func6&gt;:
 <span style="color: #F92672;">8048650</span>:   c3                      ret             <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#22240;&#20026;func6&#26080;&#20219;&#20309;&#36755;&#20986;&#21450;&#21103;&#20316;&#29992;&#65292;&#25152;&#20197;&#30452;&#25509;&#36820;&#22238;</span>
 <span style="color: #F92672;">8048651</span>:   66 90                   xchg   <span style="color: #FD971F;">%ax</span>,<span style="color: #FD971F;">%ax</span>
 <span style="color: #F92672;">8048653</span>:   66 90                   xchg   <span style="color: #FD971F;">%ax</span>,<span style="color: #FD971F;">%ax</span>
 <span style="color: #F92672;">8048655</span>:   66 90                   xchg   <span style="color: #FD971F;">%ax</span>,<span style="color: #FD971F;">%ax</span>
 <span style="color: #F92672;">8048657</span>:   66 90                   xchg   <span style="color: #FD971F;">%ax</span>,<span style="color: #FD971F;">%ax</span>
 <span style="color: #F92672;">8048659</span>:   66 90                   xchg   <span style="color: #FD971F;">%ax</span>,<span style="color: #FD971F;">%ax</span>
 <span style="color: #F92672;">804865b</span>:   66 90                   xchg   <span style="color: #FD971F;">%ax</span>,<span style="color: #FD971F;">%ax</span>
 <span style="color: #F92672;">804865d</span>:   66 90                   xchg   <span style="color: #FD971F;">%ax</span>,<span style="color: #FD971F;">%ax</span>
 <span style="color: #F92672;">804865f</span>:   90                      nop
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: xuali2</p>
<p class="date">Created: 2020-11-02 Mon 11:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
